[
  {
    "name": "Ain’t That Loving You",
    "artist": "Alton Ellis",
    "description": "A nice slow burner to get things started - I have opened many sets with this record over the years. The 12” is still your average pressing compared to most Studio One 12”s fidelity wise, but has a fantastic extended mix with a great dub. While the 45 pressing has only minor surface noise, pops, and crackles, it doesn’t stand up to the 12” sound (which includes overdubs and disco effects).",
    "photo": "img/1.jpg",
    "year": "1978"
  },
  {
    "name": "Nanny Goat",
    "artist": "Larry Marshall",
    "description": "All-time Jamaican smasher, a noted transitional point from rocksteady to reggae. The 12” mix is beefed up a bit with just the right overdubs. The choice pressing to play loud, with minimal background hiss present. On some daytime backyard party/bbq type shit. The 45 mix is the classic original release, and if that’s what you’re looking for go with the original Supreme pressing or the blank - all pressings are loud but do have surface noise and imperfections.",
    "photo": "img/25.jpg",
    "year": "1979"
  },
  {
    "name": "Get Ready",
    "artist": "Burning Spear",
    "description": "As a result of his in-house engineers - Sylvan Morris and Larry Marshall - jumping ship due to “poor working conditions” (no further comment), Coxsone had to engineer some early 70s sessions himself, which was not his specialty.  Almost all of the original pressings, LP or 45, involving Burning Spear, sound like they were recorded in a space vacuum and have varying levels of pressing/tape hiss or background noise as a result. “Get Ready” is among the higher quality 45s and is an original pressing.  Though the sound quality still isn’t great, it’s passable over a loud sound system. There is also a similar era pressing on label variant “Coxson” of similar quality using the same stampers. If you’re just looking for clean, it’s best listened to on Soul Jazz or Heartbeat’s reissue retrospectives, as is all of the Burning Spear material.",
    "photo": "img/78.jpg",
    "year": "1975"
  },
  {
    "name": "A Love I Can Feel",
    "artist": "John Holt",
    "description": "Foundation Studio One track versioning the Temptations in excellent style. I have DJed all of the early 45 pressings over the years, the Coxsone pressings, the blank, and the UK Bamboo pressing. All sound OK but are rough and ready with inconsistent surface noise and distortion on the chorus. Might as well get as close to the source as possible - I play the blank most often. Repressed nicely on Heartbeat’s 2006 expanded release of their “Best of Studio One” compilation.",
    "photo": "img/49.jpg",
    "year": "1970"
  },
  {
    "name": "Africa Here I Come",
    "artist": "Freddie Mcgregor",
    "description": "For years I DJed the 80s and 90s 45 pressings of this because it was all I had at the time. You can play them out if that’s what you’re working with - they sound decent even with a fair amount of crackling from the press. However, in reality, the 90s pressing (b&w label) isn’t perfect, and neither is the 80s Rosette copy. If you can get your hands on this 10” on Music Lab pressing, you’ll be a lot happier with the sound and minimal to no pressing noise. Also repressed on Studio One Roots (Soul Jazz), which is widely considered to be a landmark reissue compilation.",
    "photo": "img/151.jpg",
    "year": "1980"
  },
  {
    "name": "I've Got To Go Home",
    "artist": "Bob Andy",
    "description": "The best way to listen to this Bob Andy masterpiece is on the Studio One 12”. Many look at the song as a longing to go back to Africa and a precursor to the roots style that would follow in the 70s, but I think of it more as a universal anthem for all those who are homesick. I’ve DJed a couple of copies of the first pressings of this tune on 45, which are loud but play with pressing noise. The blank would be the best of the lot, but it still plays with surface noise. The Island UK pressing somehow has, even more, noise than the Jamaican Coxsone pressing. None of the 45s sound as good as this 12” (though it isn’t perfect) and the extended mix is a bonus.",
    "photo": "img/20.jpg",
    "year": "1977"
  },
  {
    "name": "Going Home",
    "artist": "Bob Andy",
    "description": "My favorite Bob Andy tune of all time, top shelf Studio One! For years I DJed this song off the full length, “Bob Andy’s Song Book.” The best pressing of that album by far is the early 80s NYC pressing (yellow and red label). It took me years to find this original 45, which I play out now over the LP despite the slight surface noise. The other 70s pressing (green Coxson label) and the Muzik City blank both play very similar, if not the same. The UK pressing plays with less noise than any of the original Jamaican pressings in this case, but doesn’t knock as hard as the Jamaican pressing does.",
    "photo": "img/80.jpg",
    "year": "1969"
  },
  {
    "name": "I Don't Know",
    "artist": "Freddie McGregor",
    "description": "Thick, dark, early Freddie McGregor over the “Just Say Who” riddim, in severe need of a quality repressing of any sort! Similar to many of the Money Disc pressings of this period, it plays soft and has too much pressing noise. I don’t play this out often because of the pressing quality - daytime roots party material only.",
    "photo": "img/96.jpg",
    "year": "1975"
  },
  {
    "name": "Peace True Thing",
    "artist": "DJ Dawn and The Ranking Queens",
    "description": "One of my go-to tracks over the past few years. Murderous cut flipping “I’m Still In Love With You.” Soul Jazz’s “Studio One Dancehall” is by far the best way to hear this record - I started playing it out because I finally had a good pressing of this monster tune. The original pressing has odd defects and press bubbles, background noise, and does not sound as good or as loud as the repress on Soul Jazz.",
    "photo": "img/42.jpg",
    "year": "1981"
  },

  {
    "name": "Mr. Bassie",
    "artist": "Horace Andy",
    "description": "A Foundation riddim to say the least! I prefer this extended 12” mix on “Winro,” an Italian bootleg, to all the other versions. The multiple Jamaican-pressed 12”s from the late 70s play loud but with more surface noise. Mr. Bassie was also recently repressed by Soul Jazz on 45, clean and on thick vinyl. The Soul Jazz 45 pressings, in general, are good but sound digitally remastered to me (hard to explain). So unless the original Jamaican pressings leave a lot of room for improvement, I prefer the original master. This extended mix is also compiled by Heartbeat on “Nice Up The Dance - Studio One Discomixes” and they also put out a shorter version on the Horace Andy specific “Mr. Bassie” compilation.",
    "photo": "img/24.jpg",
    "year": "1978"
  },

  {
    "name": "Pearl",
    "artist": "Alton Ellis",
    "description": "One of the rarest Studio One 12 inches of all time. Never repressed and not available elsewhere. “Pearl” is a criminally overlooked Alton Ellis tune, written about his wife, and this extended mix of Pearl is dope. One of my top Studio One sides of all time. I have sessioned this heavily over the years - before I had the 12”, I played it out off the Alton Ellis “Best Of” compilation on Studio One. The red and yellow 80s NYC pressing is the best way to go for that LP, but the 12” is much louder and way better for a dance floor.",
    "photo": "img/28.jpg",
    "year": "1969"
  },
  {
    "name": "Queen Of The Minstrel",
    "artist": "Cornell Campbell",
    "description": "There is a variety of 45 pressings of this song, but none sound as good as the 12”. The Jamaican Supreme pressing and the UK Coxsone pressing would be choice if you are looking for this on 45, but be aware that the UK Coxsone pressing miscredits the song to the Heptones. The 12” sounds incredible if you can get ahold of it - a nice quality US 12” pressing of Studio One is as good as it gets. If you don’t need an original, the tune sounds great on both “Studio One Soul” released by Soul Jazz and “Nice Up The Dance - Studio One Discomixes” released by Heartbeat.",
    "photo": "img/31.jpg",
    "year": "1982"
  },
  {
    "name": "I Shall Be Released",
    "artist": "Freddie Mcregor",
    "description": "One of the Studio One records I’ve played the most over the years and one of the best extended mixes the label’s released. For years I DJed it off the “Studio One Kings” LP by Soul Jazz, which sounds good, but then I got a copy of the original 12”, and it sounds fantastic! The 45 is a missed opportunity as it breaks the song in half over each side, but is a solid pressing. I have played this at literally every occasion you can think of from weddings to funerals - a very potent record.",
    "photo": "img/35.jpg",
    "year": "1977"
  },
  {
    "name": "Roots Natty",
    "artist": "Gladiators",
    "description": "The original pressing of this 45, the blank, and any subsequent repress sound like they were pressed in the same garbage dump as the Burning Spear material. Ultimately they were just a result of some terrible engineering by the man himself, Coxsone Dodd, and some phase shifting gone wrong. Pressed low, murky and full of tape hiss on 45 - it’s barely playable at home. What a shame as this is a slow burner! Best played off one of the various Gladiators compilations or the “Best of Studio One” LP put out on the  Heartbeat label.",
    "photo": "img/139.jpg",
    "year": "1975"
  },
  {
    "name": "Behold",
    "artist": "Culture",
    "description": "An all-time roots scorcher and a favored tune of mine over the years. I never could afford the 45 pressing, so I used to play it off of “Studio One Roots 2”. The original pressing of the 45 sounds decent and comes with a high price tag when it shows up on auction. Soul Jazz repressed the 45, a high quality pressing with a different b-side.  About three years ago I found this 12” and realized I like the 12” mix way better. Now one of my top ten Studio One 12” inches.",
    "photo": "img/3.jpg",
    "year": "1978"
  },
  {
    "name": "Roots Natty Roots",
    "artist": "Devon Russel",
    "description": "The original 45 of this sounds super clean. I usually play it instead of the Gladiators version as it so much better quality and can be played out. The tune also is pressed well on “Studio One Kings” by Soul Jazz.",
    "photo": "img/140.jpg",
    "year": "1981"
  },
  {
    "name": "Hooligan (Change Your Style)",
    "artist": "John Holt",
    "description": "The 12” mix is the way to go, as this is one of my favorite Studio One dubs ever. Heartbeat put the 12” mix on their John Holt compilation, “I Can’t Get You Off My Mind,” which is amazing and compiled all his best Studio One material. The sound quality is excellent, and the same is true for its inclusion on “Studio One Rude Boy” via Soul Jazz. “Hooligan” sounds better on the Heartbeat compilation than the original pressing. I played the dub off of the 70s 45 pressing on Coxsone for years at many house parties, which is also top notch.",
    "photo": "img/18.jpg",
    "year": "1978"
  },
  {
    "name": "Heavy Dub",
    "artist": "Sound Dimension",
    "description": "I picked up the original pressing of this about ten years ago and have DJed it exclusively ever since. It’s on the higher end of quality for 70s Coxsone pressings. I didn’t realize how ill the dub was and had never heard the dub mix before I got this one on 45. “Heavy Rock” is the foundation riddim but “Heavy Dub” is the one.",
    "photo": "img/84.jpg",
    "year": "1976"
  },
  {
    "name": "Every Man A Mi Bredren",
    "artist": "Brigadier Jerry",
    "description": "I have always played the original 12”, and it sounds banging. One of the most influential Jamaican DJs of all time forwarding the Soul Vendors’ “West Of The Sun.” The Music Lab pressing is pretty similar to the Studio One pressing, and both sound good on a loud sound system. Repressed cleanly by Soul Jazz on “Studio One DJ’s” as well. (Note: a mini set of Brigadier Jerry will always get people moving.)",
    "photo": "img/10.jpg",
    "year": "1983"
  },
  {
    "name": "Equal Rights",
    "artist": "The Heptones",
    "description": "One of the Heptones seminal songs, appropriate for any decade. This 45 is the album version, which I prefer. I played “Equal Rights” off the LP for a long time, and it wasn’t the greatest, but it worked if I turned it up a bit to compensate. The 12” mix has a different feel to it, and I prefer the original version on 45.  The 12” mix is the only place you can find the extended cut with Jah Buzz, as it has not appeared on a compilation (I believe the overdubbed drumming is Freddie McGregor on that one). I also at one point DJed the most coveted and most expensive pressing, the pre-release blank, which plays similar to the release with slightly more surface noise. In short, since I’ve gotten this 70s pressing, I’ve run it out exclusively.",
    "photo": "img/9.jpg",
    "year": "1978"
  },
  {
    "name": "Time A Run Out",
    "artist": "Johnny Osbourne",
    "description": "Before Soul Jazz reissued this on the recent “Studio One Dancehall” compilation, this was a tough tune to find on the Hot Milk riddim.”Time A Run Out” was previously only on a rare 12” pressing until Soul Jazz went on to reissue it in 2016, but with a different b-side. “Studio One Dancehall” is one of the better pressings of any of the Soul jazz compilations, partially due to the selections being spread out over three LPs. I still play the original pressing though.",
    "photo": "img/38.jpg",
    "year": "1983"
  },
  {
    "name": "My Satisfaction",
    "artist": "Paragons",
    "description": "I highly recommend the 12” pressing of “My Satisfaction” - loud and warm, with a good bass sound and only a subtle hiss. The Heartbeat compilation of John Holt’s Studio One material also has this 12” mix on there and sounds pretty good loud, but not as rich a sound as the original 12” pictured here. For a long time, the holy grail pressing of this song for me was the UK Coxsone blue label, mainly because it pairs Lester Sterling’s “Afrikaan Beat” on the b-side. High on my want list for years, I was a bit disappointed when I finally sourced a copy, and there was hiss on the “My Satisfaction” side. I owned the blue Supreme pressing at one point, but I traded it because it was subpar for DJing due to considerable pressing noise and distortion.",
    "photo": "img/182.jpg",
    "year": "1977"
  },
  {
    "name": "Happy Man",
    "artist": "The Gladiators",
    "description": "Deep Gladiators crusher right here. This pressing is another Italian 2000s “Winro” bootleg, which plays surprisingly decent, with only minor pressing noise at times (as does the original Studio One pressing, which I oddly find more annoying). The song is also present on Heartbeat’s excellent but out-of-print “Studio One Singles” compilation of all the Gladiators material at Brentford Road and Soul Jazz’s “Studio One Supreme” retrospective on Studio One in the ‘70s and ‘80s.",
    "photo": "img/13.jpg",
    "year": "1979"
  },
  {
    "name": "How Could I Live",
    "artist": "Sharks",
    "description": "This later 12” mix has never let me down - a serious warm-up tune. It has never been repressed or compiled, a crucial tune. The pressing is average, with some surface noise, and the mix isn’t too heavy on the overdubs, just enough for the dancehall. The later Coxsone 70s repress (with text on both sides of the label) is the same mix to the 12”. The original UK pressing (red and white label) is the choice pressing if you’re looking for the original mix, a bit slower mix and with no overdubs. I prefer the UK pressing mainly because the original two Jamaican pressings (including the blank) have varying levels of surface noise on top of the music, apparently inherent to the original stamper. The UK press isn’t perfect but does play good loud.",
    "photo": "img/15.jpg",
    "year": "1968"
  },
  {
    "name": "Time Is Getting Hard",
    "artist": "Hubert Lee",
    "description": "One of the most criminally slept on Studio One songs - I have never heard anyone else play this song out before. Top shelf roots music that is still very relevant decades later. It’s on some long road shit. Included here is the original 45 pressing and it's overly bass heavy and oddly mixed in general. But this is all we’ve got; never been reissued in any format.",
    "photo": "img/169.jpg",
    "year": "1977"
  },
  {
    "name": "Strange Things",
    "artist": "John Holt",
    "description": "I waited years to get this on 45. Coxsone’s “Tranquility” pressings can be tough to find,  showing up on eBay every year or two. This pressing is average, and it has the instrumental on the b-side, which is hot. An easier clean way to play this is also off the John Holt Studio One compilation on Heartbeat or  “Studio One Rocksteady 2” by Soul Jazz. This Coxsone mix is subtly different than the more common Phil Pratt Sunshot production.",
    "photo": "img/159.jpg",
    "year": "1971"
  },
  {
    "name": "Throw Mi Corn (Ver.)",
    "artist": "Larry Marshall And Sound Dimension",
    "description": "This song is a classic but I have played it sparingly over the years, and I always run the riddim on the b-side. The riddim is a favorite of mine and a clutch warm-up tune. I prefer this ‘80s NYC pressing (red and yellow label), though all the pressings are somewhat rough, including the 70s Studio One label pressing and even the original Supreme issue. The main quality issue is substantial tape hiss most likely a result of the bouncing of the tracks multiple times to handle the double-tracked vocals. The Ackee UK pressing from the same period also plays with noise. A dubbier mix is on “Studio One Story.” By Soul Jazz.",
    "photo": "img/168.jpg",
    "year": "1973"
  },
  {
    "name": "Death In The Arena",
    "artist": "Soul Vendors",
    "description": "The “Death In the Arena” riddim shows up multiple times in Coxsone productions over the years but this 12” is the best way to hear it. Plus you get the extended mix of “Equal Rights” with the DJ cut on the flip side. If I’m going to be playing for a while and have time to stretch out, I will play 40 minutes or so of classic Studio One riddims, always including this mix. Heartbeat repressed their compilation of Studio One instrumentals, “Downbeat The Ruler,” on a fat double lp and included this extended mix (sounds clean, too). Chris from Heartbeat always used the master tapes when possible, apparently.",
    "photo": "img/154.jpg",
    "year": "1978"
  },
  {
    "name": "Take A Ride",
    "artist": "Al Campbell",
    "description": "This pressing with the red, green, and white label is the best. The original pressing (black and white Studio One design) has more noise to me, as does the blank. This 45 mix is off the compilations “Studio One Roots 2” (Soul Jazz ) or “When Rhythm Was King” (Heartbeat). You can also find “Take A Ride” on a very coveted 12” (goes for hundreds of dollars on auction) with a more dubby uptempo mix.",
    "photo": "img/162.jpg",
    "year": "1973"
  },
  {
    "name": "Ram Dance Master",
    "artist": "Brigadier Jerry",
    "description": "Brigadier Jerry indeed was the ram dance master, and this is one of the pinnacles of 80s Jamaican toasting for me. Crucial DJ cut reissued on “Studio One DJs 2” by Soul Jazz, but I’m fortunate enough to have found the 12” - the pressing is good, so I’ve never had a reason to switch it up. It’s not easy to find this original, so thankfully the version on the Soul Jazz compilation is a great backup option.",
    "photo": "img/32.jpg",
    "year": "1983"
  },
  {
    "name": "Thanks And Praise",
    "artist": "Devon Russel",
    "description": "I first heard this song on a tape of an 80s Shaka session and knew right away I needed this piece of Studio One 80s roots. The 45 pressing sounds alright, it’s loud and has a bit of pressing noise, so it’s passable. If you don’t need the original, it plays better on “Studio One Dancehall” (Soul Jazz).",
    "photo": "img/165.jpg",
    "year": "1981"
  },
  {
    "name": "Truth And Rights",
    "artist": "Johnny Osbourne",
    "description": "Very nice 45 repress from Soul Jazz in 2015, a preferred DJ copy. Not pressed on 45 by Coxsone himself until the 90s and not very high quality at that point either. This roots classic is on the “Truth and Rights” full length - the original US pressing, the OG Jamaican pressing, and the Jamaican Rosette label pressing all sound good. The three LPs have the same matrix number and sound pretty similar head-to-head with subtle differences between the Jamaican and US pressings.  Also repressed by Soul Jazz on the “Studio One Rockers” compilation.",
    "photo": "img/173.jpg",
    "year": "1979"
  },
  {
    "name": "Armageddon Time",
    "artist": "Willie Williams",
    "description": "Old punk rockers favorite right here. The “Real Rock” riddim always gets people moving, really shining over the years in house party situations for me. This 12” mix is my favorite cut of “Real Rock” ever - the extended mix is just insane, keeps people going until the end! A serious floor filler. I’ve never confirmed this, but I know Scientist (too little fanfare) did engineer most of the Willie Williams material for Coxsone, and that would make sense in this case as the dub is out of this world and way beyond anything Coxsone ever did as Dub Specialist. The choice original 45 pressing would be the Studio one Jamaican pressing (white and black label) with “Jamrec Music” to the left side and cut off by the center hole. The red label pressings I’ve found play with slightly more surface noise. As a reissue, it’s also pressed nicely on “Studio One Disco Mix” and 45 by Soul Jazz.",
    "photo": "img/2.jpg",
    "year": "1979"
  },
  {
    "name": "My Man Is Gone",
    "artist": "Aneglia Prince",
    "description": "A well done female response version is a thing of beauty, and Angela Prince gives her answer to “My Heart Is Gone” with style. Should have been included on Soul Jazz’s “Studio One Women” compilation in my opinion. This US pressing is choice to the original Jamaican pressing as it plays louder and with slightly less surface noise (although not perfect in that regard).",
    "photo": "img/115.jpg",
    "year": "1980"
  },
  {
    "name": "I Am The Ruler",
    "artist": "Anthony Rocky Ellis",
    "description": "Rocky Ellis was the precursor to guys like Banana Man, specializing in sound clash devastation related releases. \"I Am The Ruler\" is a rough and tough record that I have played many, many times over the years. This US 45 pressing sounds good, but can be expensive if you find a copy. The black text, white label repress from the same era (1978) uses the same stamper and is also a good DJ copy.  Originally from 1968 with a new mix laid down and first issued in the late 70's (with percussion & keyboard overdubs). The original mix on the red and white label UK issue from the late 60s and a Jamaican issue from the same time. I tried Djing it a few times years ago, and I hated the way it sounded loud - it has that odd piercing quality that some UK pressings of this period have. In short, I much prefer the 70s mix of this top tune. “I Am The Ruler” is on the “Studio One Kings” compilation on Soul Jazz which sounds solid.",
    "photo": "img/95.jpg",
    "year": "1968"
  },
  {
    "name": "I Was Born To Be Loved",
    "artist": "Righteous Flames",
    "description": "Certain record stores would never let me bring a portable record player in when I was younger (always hated that about Amoeba!), or I was scared if I did bring it out someone would yoke me for it. So I guessed on a lot of what I would pick up, typically based on how the names of artists sounded, and therefore always passing on the Righteous Flames material because I guess it was some gospel kind of shit. After getting more of a Jamaican music education, I kicked myself for passing up so many fantastic 45s. A few years ago I finally got this tune on 12” from a friend of Albert Malawi, longtime operator of the Jahlovemuzik sound system, who was selling some of his records. If you are looking to acquire this song on 45, the Jamaican blank or the UK Coxsone blue label would be the choice pressings, but both are expensive and highly coveted. However, all 45 pressings of this song, especially those from the 1970s, have varying levels of hiss and noise on them.",
    "photo": "img/150.jpg",
    "year": "1977"
  },
  {
    "name": "Hot Milk",
    "artist": "Jackie Mittoo",
    "description": "I have played so many different cuts over the years on Hot Milk, and people love pretty much all of them at a party. I still go back to the source more than anything. Oddly, I prefer the Coxson pressing to the sound of the usually superior UK Banana pressing, though both have minimal pressing/surface noise. There is also a Coxsone blank, which is similar and still playing with subtle background noise. Plays cleanly off of “Studio One Rockers” (Soul Jazz) - many burners on that compilation and pressed well.",
    "photo": "img/89.jpg",
    "year": "1977"
  },
  {
    "name": "Real Rock",
    "artist": "Sound Dimension",
    "description": "I got this first pressing of the 70s mix with some added drums and reverb a few years ago from Ernie at Ernie B’s. He told me it was the best pressing of the tune and he was right. Ernie doesn’t mess around and like me loves some proper rough and rugged Jamaican style mixing and mastering. Only some slight noise and plays loud. I have DJed it ever since. The original mix is from the 60s, and I’ve played it out over the years on the UK Coxsone blue label, the Jamaican blank, and a later Coxsone 70s repress (highly desired as it pairs Al Campbell “Don’t Run Away” on the flipside). All of those pressings play loud with background noise and static, and I just prefer the sound of the 70s mix featured here. Repressed multiple times by Soul Jazz on the Sound Dimension/Soul Vendors compilation, “Mojo Rocksteady Beat,” and the essential “Studio One Rockers” compilation. Heartbeat also reissued the tune on the timeless “Downbeat the Ruler” compilation, the definitive collection of Studio One foundation riddims.",
    "photo": "img/133.jpg",
    "year": "1978"
  },
  {
    "name": "Can I Change My Mind",
    "artist": "Alton Ellis",
    "description": "Heartbeat did some nice work with the Studio One catalog, though I wish they had continued reissuing more of the extended 12” mixes Coxsone put out in the late 70s and early 80s. The only compilation of 12” mixes Heartbeat put out, “Nice Up The Dance,” was good. The cover was hideous, and the name couldn’t have been more boring, but it was a quality release. That is the easiest place to find this disco mix of “Can I Change My Mind,” but the original pressing sounds fine, good for playing out. The original JA 45 pressings of this song (including the blank) play loud but have light static in the background. The UK pressing from the same period, the late 60s, is mistitled as “Change of Plans.” The single mix was also reissued on “Studio One Ironsides” by Soul Jazz more recently and plays clean.",
    "photo": "img/4.jpg",
    "year": "1968"
  },
  {
    "name": "Love In The Dance Pt. 2",
    "artist": "Brentford Rockers",
    "description": "I never much liked Jim Brown’s DJ cut on the A-side, but I own and have packed this 45 in my crate for years because the riddim it’s on, “Shank I Sheck” is a pillar of any sound system session. Beyond a classic riddim, it’s ingrained into Jamaican culture at this point and having it in your box is crucial! Very nice pressing.",
    "photo": "img/107.jpg",
    "year": "1981"
  },
  {
    "name": "Call On You",
    "artist": "Burning Spear",
    "description": "This cut is my favorite Burning Spear song of all time. As a personal anthem of mine, I have played it an endless number of times over the years in any format I can get. Again most of the Burning Spear material for Coxsone is terrible quality, especially the initial runs, but this 45 is surprisingly decent (by comparison). It still has some light static present on top of the music, and it's not perfect. If you don’t need the original, this song sounds best on Soul Jazz or Heartbeat’s Studio One Burning Spear retrospectives, which are both unfortunately out of print, but either is worth acquiring for superb presentation and sound quality.",
    "photo": "img/54.jpg",
    "year": "1974"
  },
  {
    "name": "Money Problem",
    "artist": "Devon Russell",
    "description": " A deep Studio One 12”, never compiled or repressed. A late-era Coxsone production - hard cut on the immortal “Darker Shade of Black” with serious 80s vibes. Loud pressing, as you would expect of a good quality Studio One 12”. You can’t find it anywhere but on this 12”, so keep digging! ",
    "photo": "img/23.jpg",
    "year": "1985"
  },
  {
    "name": "Bobby Babylon",
    "artist": "Freddie McGregor",
    "description": "The full length that contains this track is also called “Bobby Babylon,” and is considered by many to be a landmark album. Pressed many ways over the years, the reissues of the full length sound good. I never rated the full length as high as some people - I’m good with this track and “Rastaman Camp” on 45. For years I played out the NYC pressing (red and yellow label) of “Bobby Babylon,” but as soon as I got the 2017 Soul Jazz reissue, I realized how garbage the NYC pressing is. It’s a rare case that I prefer the Soul Jazz even to the original Jamaican pressing, which plays with static and surface noise. Also repressed by Soul Jazz on “Studio One Rockers,” which I’d recommend buying if you don’t own it. ",
    "photo": "img/52.jpg",
    "year": "1979"
  },
  {
    "name": "My Guiding Star",
    "artist": "Joe White",
    "description": "A deep cut over the “Love Me Forever” riddim with excellent songwriting (not always the case), making it a personal favorite of mine. Among the various 70s and 80s Coxsone pressings, all are average with slight noise and use the same stamper. This early 80s pressing sounds better than the original Jamaican pressing on a Muzik City blank and the black label Coxsone pressing from the same period (and both are not cheap).",
    "photo": "img/114.jpg",
    "year": "1968"
  },
  {
    "name": "Can’t Get Enough",
    "artist": "Richard Ace",
    "description": "This reworking of the Barry White classic is one of my favorite Studio One soul covers. The tune sounds best on the second pressing 45, shown here, and is superior to the first pressing. If you’re okay with a reissue (which I, personally, have nothing against), an excellent sounding version is on Soul Jazz’s “Studio One Soul” compilation - I used to take the ferry from New London to Long Island when I was younger, listening to this LP on repeat, and it was a revelation.",
    "photo": "img/55.jpg",
    "year": "1974"
  },
  {
    "name": "I’ll Give It To You",
    "artist": "Tonettes",
    "description": "I first heard this song when “Studio One Women” (Soul Jazz) came out in 2005. Other than this original 12”, that LP is the only other place to find this song with the extended dub. This original sounds great, and I have played it out for years now. The 12” mix knocks more in a house party situation, but if I were by myself in my own house, I’d play the original version as it has a bit more soul to it. For the original mix, the UK Coxsone 45 or the Jamaican blank from 1968 play pretty good with light occasional surface noise and no overdubs - I prefer the Jamaican blank over the UK pressing.",
    "photo": "img/179.jpg",
    "year": "1968"
  },
  {
    "name": "Won’t Give Up",
    "artist": "Ethiopian",
    "description": "I don’t rate many Coxsone-produced full lengths very highly, most of the time I just want to hear the singles without the extra filler songs. That is not the case with Leonard Dillon’s masterwork, “Everything Crash.” One of my favorite records ever, incredible lyrical content, delivery, and riddims. Recording at this point as the “Ethiopian” after his bandmate, Stephen Taylor, in the Ethiopians was tragically killed in an accident. I recommend listening to this track on the LP and then listening to every other song on the album right after. All of the early 80s pressings are pretty similar and good, and all pressed from the same stampers.",
    "photo": "img/152.jpg",
    "year": "1980"
  },
  {
    "name": "Rougher Yet",
    "artist": "Slim Smith",
    "description": "Straight to all downpressors’ heads! What a tune, hyper-relevant decades later. Every pressing of this, and I have owned most, has hiss - even the pre-release blank  - which is a shame for a tune this hard. Even the expensive UK Coxsone pressing from the 60s has surface noise/tape hiss. I recommend playing it out on “Studio One Classics.” At first, I thought Soul Jazz ripped the vinyl for this release as the hiss is still present, but then I heard “Best of Studio One 2” on Heartbeat, who used master tapes for their reissue,  and the hiss is still there.",
    "photo": "img/33.jpg",
    "year": "1967"
  },
  {
    "name": "Darker Shade Of Black",
    "artist": "Soul Vendors",
    "description": "The UK pressing credited to Jackie Mittoo as “Norwegian Wood,” based on the Beatles song of the same namesake. The best pressing of this song with the least amount of surface noise but needs to have the highs turned down considerably when played out. I’m listing it as the more common titling “Darker Shade of Black” as all other pressings use this title. The early Jamaican pressings with the Gaylads on the flipside are pretty rough quality, plenty of surface noise on those, even the blank. The later 70s Jamaican pressings utilize the UK stamper and are a better bet for playing out, but do have background hiss. One of my favorite foundation riddims of all time, later redone by The Roots Radics for Frankie Paul’s colossal dancehall anthem, “Pass the Tu Sheng Peng.” Reissued on Heartbeat’s seminal “Downbeat The Ruler” compilation as well.",
    "photo": "img/120.jpg",
    "year": "1967"
  },
  {
    "name": "Miss Haite Taite",
    "artist": "Westmorelites",
    "description": "My most wanted 45 for a long time - for years I have DJed it off the “Ride Me Donkey” compilation. This 45 sounds good loud, a clean pressing. I prefer the Jamaican pressing over the UK because it plays warmer and with less noise. Very hard to find and will cost a few hundred dollars even in rough shape unless you get lucky. I prefer this pressing with the Gaylads on the b-side to the pressing with Mr. Foundation on the b-side, or to the blank, even though they both use the same stamper.",
    "photo": "img/113.jpg",
    "year": "1968"
  },
  {
    "name": "Dance In A Montreal",
    "artist": "Brigadier Jerry",
    "description": "One of the first Studio One 12 inches I owned. My mother, an old-time Studio One fan, gave it to me for Christmas when I was 21. It never fails in a party situation and is my favorite cut on the “Diseases” riddim (hard to have a proper reggae house party without at least one tune on this riddim). A very slept on track and the pressing is loud. The Studio One and Music Lab pressings are both from the same period roughly and use the same stamper.",
    "photo": "img/8.jpg",
    "year": "1985"
  },
  {
    "name": "Jah Promise",
    "artist": "Johnny Osbourne",
    "description": "Album only cut - you can find it on the LP or on this Heartbeat “Best of Studio One” compilation, which has excellent remastered sound quality and is easy to find. A re-lick of the Chosen Few’s “Don't Break Your Promise,” I tend to run this off the original US pressing of the “Truth and Rights” LP, and it sounds good. The Rosette label represses, or the original Jamaican pressing is also good to play out. Soul Jazz also included this on their anthology of later-era Studio One productions, “Studio One Supreme.”",
    "photo": "img/144.jpg",
    "year": "1979"
  },
  {
    "name": "Mellow Mood",
    "artist": "Roland Alphonso",
    "description": "Deep Roland cut over a riddim based on the Guess Who’s “These Eyes.” The UK pressing from 1971 which is a bit rough around the edges (similar to the Jamaican pressings), but a bit louder and with a different b-side, an old ska tune by the Maytals. All Jamaican issues from this period have the same matrix number and stamper.",
    "photo": "img/110.jpg",
    "year": "1971"
  },
  {
    "name": "Ya Ho",
    "artist": "Viceroys",
    "description": "I have owned and played this roots cut off a few early 45 pressings for many years, and none of them sound that great. The Jamaican original pressing (usually a blank) and the UK pressing would be top picks but still, have background noise evident. Thankfully, this 12” is much better! It’s one of my most coveted Coxsone records, with incredible drumming on the dub. I have both pressings of the 12”, and according to Discogs, they’re both from Jamaica, though it seems like this is the US pressing by the label. Both pressings sound clean, with some light noise. The Jamaican 1980 pressing (not pictured) is louder but has a defect which skips on the version. Either copy routinely sells for a couple of hundred dollars when it even shows up on auction or Discogs.  The 12” mix is on Heartbeat’s “Six The Hard Way,” miraculously.",
    "photo": "img/44.jpg",
    "year": "1977"
  },{
    "name": "So Much Love",
    "artist": "Alton Ellis",
    "description": "Alton's version should have been a hit - one of my favorite Alton tunes, though initially written by Carole King. I read an Alton interview years ago in which he mentioned that he thought his greatest strength was the ability to adapt American songs to a Jamaican beat. I’d have to agree; he is the master of such. The 80s NYC pressing of this LP (red and yellow label) is the logical choice for best pressing, and even this one is subpar. The Coxsone UK issue is the best I’ve come across to play loud. I would just take whatever pressing you can get for cheap, honestly. Most pressings of this record are terrible, with the sound quality varying from track to track - it’s a shame as the LP compiles some of the best songs Alton did for Coxsone.",
    "photo": "img/146.jpg",
    "year": "1967"
  },{
    "name": "Sitting In The Park",
    "artist": "Alton Ellis",
    "description": "The 80s US pressing pictured here is by far the best way to DJ this song out. This record was only on the “Best of Alton Ellis” LP, an excellent compilation until in the 80s and 90s Coxsone pressed it as a 45 single with a sweet version on the b-side.",
    "photo": "img/155.jpg",
    "year": "1969"
  },
  {
    "name": "Feel Good All Over",
    "artist": "Delroy Wilson",
    "description": "This 12” sounds good. I think it sounds like a high quality US pressing but I’ve seen it listed as the UK release in numerous shops in Tokyo so and I haven’t been able to confirm one way or another. Most of the early 45 pressings sound OK (including the blank), but they all play with small degrees of distortion and subtle background noise. All of these pressings use the same FCD (Federal) prefixed matrix number, hence the similar quality. I’ve had a few copies of the OG UK pressing over the years, even one in mint condition, and when I played it loud, my wife said: “it sounded like nails on a chalkboard.” Not a promising review. If you can find it, play out the 12”.",
    "photo": "img/11.jpg",
    "year": "1968"
  },
  {
    "name": "Respect",
    "artist": "Norma Fraser",
    "description": "For years I’ve wanted the UK Coxsone 45 but could never find it or afford it, and I’ve heard it plays well. For years I just played the tune off “Studio One Soul,” which is pressed well and on thick vinyl. Soul Jazz then went above and beyond and repressed \"Respect\"  on 45, which I now play out over the LP. The reissue 45 on Soul Jazz sounds fat and loud. I compared the extremely rare Jamaican blank to the Soul Jazz pressing, and I thought the Soul Jazz played better with less distortion and surface noise.",
    "photo": "img/135.jpg",
    "year": "1968"
  },
  {
    "name": "Never Let Go",
    "artist": "Slim Smith",
    "description": "This 12” of “Never Let Go” is the only way to hear the extended mix of one of the greatest Studio One songs by one of Jamaica’s great vocalists.  Plus, “Answer” is one of those riddims you just need in your box if you are playing sound system style. The pressing is garbage compared to most Studio One 12 inches, but the music is phenomenal so you just take what you can get. The instrumental is a bit better as the vocal track sounds a bit distorted, but neither is great. I have owned multiple copies of the pre release blank that pairs this tune with &lsquo;Rougher Yet&rsquo; but Never Let Go has annoying pressing noise and static on top of the music. ",
    "photo": "img/26.jpg",
    "year": "1967"
  },
  {
    "name": "I’m Still In Love With You",
    "artist": "Alton Ellis",
    "description": "One of Alton’s most celebrated songs about his wife, Pearl - it was a rocky romance, and they separated eventually, but through the course of their relationships, she inspired Alton to write and sing some of his best material. “I’m Still In Love With You” was supposedly recorded at Abbey Road in England while the Soul Vendors and Alton were on tour. Chris Peckings confirmed this as he housed the artists while they were doing the recording sessions. The original UK pressing which, like every 45 of this pressing, sounds half decent. There’s minimal press noise, and at times minor distortion is present. I owned and used to play the original Jamaican pressing, which sounds pretty similar to the UK pressing. Both are still playable out, but honestly, the song sounds better on “Studio One Story” (Soul Jazz). And even on the Soul Jazz release, the quality isn’t great, so you can tell that the noise/distortion is likely coming from the recording itself. Soul Jazz again compiled the song on “Studio One Rocksteady 2”. Heartbeat compiled it on the compilation of the same name, “I’m Still In Love With You.”",
    "photo": "img/94.jpg",
    "year": "1967"
  },
  {
    "name": "Too Experience",
    "artist": "Bob Andy",
    "description": "Laying the groundwork for Barrington Levy years beforehand, most of the 45 pressings of this sound good.  The UK pressing is very expensive and rare but has background noise. This original Supreme pressing is the best I’ve heard, though I also owned the blank at one point and it’s pretty similar to the Supreme (some minor pressing noise on both). I also for years played the 70s second press, which has a tiny bit more hiss but is fine for playing out.",
    "photo": "img/171.jpg",
    "year": "1968"
  },
  {
    "name": "I’m Not A King",
    "artist": "Delroy Wilson",
    "description": "I always liked the Studio One version of this tune better than the later Striker Lee rendition. The original UK pressing on a blank. I usually like the Jamaican mixing and mastering over the UK’s, but not in this case. The 70s Jamaican second press or the original pressing on a blank isn't terrible - I DJed them both for years and didn’t mind the consistent low background/pressing.",
    "photo": "img/121.jpg",
    "year": "1967"
  },
    {
    "name": "Won't You Come Home",
    "artist": "Delroy Wilson",
    "description": "One of the songs I cherish most on the Studio One label. An incredible song that has soundtracked many events and times in my life. This late 70s/early 80s Studio One 12” sounds good and is solid for playing out. The Forward pressing (a Coxsone imprint) is a bit lower quality, with a bit more noise, but comparable. The OG UK 45 pressing is what I used to DJ, which was fine at the time with a bit of surface noise, but I never looked back once I got this 12”. The yellow and red label NYC 45 pressing is good but has slight noise, too. Plays cleanly off the top-notch “Studio One Kings” compilation (Soul Jazz) with the hiss minimized through remastering.",
    "photo": "img/43.jpg",
    "year": "1967"
  },
  {
    "name": "Your Love Is Amazing",
    "artist": "Dennis Brown",
    "description": "An overlooked classic Dennis Brown song.  Early evening crowd pleaser. The original 1972 pressing. It is semi-decent, the most you can ask for of a 70s Coxsone pressing. It’s playable out but expect some noise and crackles. The black and white label pressing and the red logo with white background label pressing from the same period play very similar. The blank is also very similar.",
    "photo": "img/177.jpg",
    "year": "1970"
  },
  {
    "name": "Consider Me",
    "artist": "Jennifer Lara",
    "description": "Possibly Jennifer Lara’s hardest tune, and a great way to dance to this riddim if you’re just tired of “I Don’t Know Why”. I consider it one of the top ranking Studio One female cuts of all time. A lot of Jennifer Lara’s output is too sweet or disco-esque for me, but this is a scorcher - house party tested many times. Also nicely pressed on “Studio One Women” and again on “Studio One Classics” both courtesy of Soul Jazz. Heartbeat also includes the song on the “Feel Like Jumping: Best Of Studio One Women” compilation.",
    "photo": "img/59.jpg",
    "year": "1980"
  },
  {
    "name": "Lend Me The Sixteen",
    "artist": "Johnny Osbourne",
    "description": "I honestly slept on this tune until “Studio One Dancehall” came out. Leave it to Johnny Osbourne to sound super hard while begging to borrow a 16 or 24 channel mixing board. I also have to give it to Stuart and the guys at Soul Jazz, they have put me up on some new shit over the years. This pressing is the most desired among a handful of so-so 80s and 90s pressings.",
    "photo": "img/103.jpg",
    "year": "1978"
  },
  {
    "name": "River Jordan",
    "artist": "Bassies",
    "description": "An essential piece of roots music from Studio One. I’ve owned various copies of this over the years, and this 70s Coxsone label pressing is the best. The original Jamaican pressing (red label) is loud but plays with noise as well. All the pressings of this tune, even the US pressing, play with some noise. The UK pressing from ‘67 is in high demand, going for hundreds of dollars even with the background noise still present. It also doesn’t fill up the room like the Jamaican pressing, which to me is one of the most important things to consider.",
    "photo": "img/137.jpg",
    "year": "1967"
  },
  {
    "name": "When Will Be The End",
    "artist": "Ethiopian",
    "description": "A serious piece of Studio One sufferers’ music. One of my top roots songs ever, on the original LP “Everything Crash” (pictured here) which is worth owning. This is the NYC red and yellow label pressing, which is the best, although all 80s pressings are similar and good. I can’t remember the last time I have played roots or Studio One without packing this LP in my crate.",
    "photo": "img/148.jpg",
    "year": "1980"
  },
  {
    "name": "Joy In The Morning",
    "artist": "Gaylads",
    "description": "This 12” version has been my secret weapon for years - just a little bit of rockers style puts this mix over the top. When Soul Jazz put out the “Studio One Showcase” compilation, they included the original 12” mix, which was the first repressing ever. This original 12” and the Soul Jazz pressing both sound good loud, with my only complaint being that the vocals are a bit washed out. The 45 pressing is the regular mix without the overdubs. I’ve had a few copies of the 45 over the years, and they were all filled with surface noise, particularly the earlier WIRL pressings, which was pretty standard for WIRL pressings in general from the mid to late 1960s. The Dr. Bird UK pressing has less noticeable background hiss than the Jamaican pressings mentioned and would be the choice copy for 45 pressings.",
    "photo": "img/19.jpg",
    "year": "1968"
  },
  {
    "name": "Swing Easy",
    "artist": "Soul Vendors",
    "description": "Skanking bordering on steppers - what a tune! A very desired 45 no matter the pressing - all use the same Matrix and sound pretty similar head to head. This is a good 70s pressing with deep bass and is the version I prefer.  The original UK issue is the most coveted, but more from a collectors standpoint as it doesn’t sound as good loud and has persistent surface noise in the background. I DJed the US pressing for many years, and it’s also very similar and playable out. Compiled by Soul Jazz on “Studio One Soul 2” and by Heartbeat on the “Downbeat The Ruler” compilation.",
    "photo": "img/161.jpg",
    "year": "1967"
  },
  {
    "name": "Happy Land",
    "artist": "Carlton And The Shoes",
    "description": "One of my top ten Studio One songs of all time! The blueprint to “Satta Massagana,” this is a clean pressing on the original red label Supreme. I own the black label Supreme, which has a pressing defect and sounds like shit - unplayable! The 2nd best pressing of this is the UK pressing, which doesn’t sound as warm as the Jamaican copy but has less noise up front (and more behind the music). I prefer the Supreme label copies over the blank.  Also, you can play this off “Studio One Groups” via Soul Jazz Records which I have done many times.",
    "photo": "img/82.jpg",
    "year": "1968"
  },
  {
    "name": "Big Car",
    "artist": "Jackie Mittoo",
    "description": "A sweet version of William DeVaughn’s “Be Thankful For What You Got,” but even the tune repressed on “Studio One Scorcher Vol. 2” sounds hissy and low quality. Makes it hard to version due to overall low-grade vibes. This is the original Jamaican pressing. Even the later US pressing  (on yellow colored vinyl) sounds similarly subpar. All pressings have issues including the pre-release blank. It's a shame for such a classic versioning!",
    "photo": "img/178.jpg",
    "year": "1970"
  },
  {
    "name": "Tell Me Where",
    "artist": "Jennifer Lara",
    "description": "Certified slayer, relicking an old Termites song, besting the original and then some. This is the 80s Rosette, red label Jamaican pressing and it’s solid. There is some pressing noise throughout, and the same goes for the red and yellow NYC pressing; head-to-head they sound almost identical. “Tell Me Where” also appears on the compilation “Studio One Women” (Soul Jazz).",
    "photo": "img/163.jpg",
    "year": "1983"
  },
  {
    "name": "Set Me Free",
    "artist": "Ken Boothe",
    "description": "Great song but unfortunately the pressing doesn't do it justice. The track is notably full of background hiss, and people have commented on the amount of noise on the track when I've tried to DJ this copy out a few times (never a great sign)!  Better for playing out on “Studio One Soul” (Soul Jazz). A Dancefloor heater with this 12” version, remixing Ken Boothe’s 1968 version titled “You Keep Me Hangin On,” which was originally written by Holland-Dozier-Holland for the Supremes in 1966.",
    "photo": "img/34.jpg",
    "year": "1978"
  },
  {
    "name": "Gates Of Zion",
    "artist": "George Dudley",
    "description": "A staple of our DJ parties in Boston. What a tune! It's not easy to combine African tribal rhythms and some variety of early trance music and end up with a roots masterpiece. Years later I found an almost mint pressing of this on 12” in a shop in Philadelphia! I run that copy out now. It's much easier to find on the compilation LP “Studio One Disco Mix” by Soul Jazz, and still sounds top notch.",
    "photo": "img/12.jpg",
    "year": "1979"
  },
  {
    "name": "Bongo Red",
    "artist": "Gladiators",
    "description": "The original pressing of this tune is almost unlistenable due to background noise. I'd recommend playing it off of either Gladiators compilation put out by Heartbeat: “At Studio One” or “Studio One Singles.” They both sound better than any of the Soul Jazz repressed material. Though not confirmed, I think Soul Jazz may have repressed the track on &lsquo;Studio One Ironsides&rsquo; from the original vinyl due to all the background hiss present. Heartbeat’s release, on the other hand, doesn’t have as much hiss so they may have gotten a hold of the original tapes and remastered it. This theory is not yet confirmed, and I welcome any insider information...",
    "photo": "img/53.jpg",
    "year": "1974"
  },
  {
    "name": "The King Is Back",
    "artist": "King Rocky",
    "description": "For the best quality at a reasonable price, I'd dig for the 2nd Jamaican pressing on Supreme. The UK pressing is very expensive, going for over $500 when it even shows up on auction. I’ve gotten lucky to find the UK pressing for relatively cheap (twice!), and both times it played with some surface noise, similar to the Jamaican pressing, and unfortunately had less bottom end. The Jamaican pressing pictured above actually uses the same stamper as the UK pressing, has the same matrix number, and is a lot more affordable. The original Jamaican pressing on Coxsone I owned at one point as well - it uses the same stamper but plays with more noise and crackles. In short, the Supreme pressing is rough and ready, playing with a bit more surface noise than desirable but ultimately loud and bass heavy. If someone plays this against you in a sound clash, pack up and go home.",
    "photo": "img/102.jpg",
    "year": "1968"
  },
  {
    "name": "All Rudies In Jail",
    "artist": "Mr. Foundation",
    "description": "One of the rarest Scully Simms cuts as his alias, Mr. Foundation. I, by a chance of fate, acquired a copy of the Jamaican pressing and prefer it slightly to the UK at this point for playing out. I had the UK pressing first, and it took me almost a decade to find. Both Jamaican and UK pressings play very similarly (with minimal noise), however they are titled differently - the Jamaican press is titled \" Jail House,\"  while the UK version is titled \"All Rudies in Jail\"  The Muzik City blank also plays the same with surface noise throughout. None are winning any awards. Reissued once over the years, by Rock A Shacka (Japan), but only on CD.",
    "photo": "img/48.jpg",
    "year": "1967"
  },
  {
    "name": "The First Cut Is The Deepest",
    "artist": "Norma Fraser",
    "description": "One of the best Studio One songs ever, always ready to break some hearts out in the crowd. All 45 pressings of this tune are rough around the edges. I like this 1977 reissue (pictured) - it's the cleanest press with the least amount of hiss and includes the dub. The original UK Coxsone from 1967 has pressing noise and pops. Compiled by Heartbeat on the “Full Up: Best of Studio One Volume 2” and \"Feel Like Jumping: The Best Of Studio One Women,\"  as well as Soul Jazz’s compilation, \"Studio One Soul,\" one of the reissue label’s strongest releases to date. \"Feel Like Jumping: The Best Of Studio One Women,\"  includes the vocal and dub in an extended mix format.",
    "photo": "img/73.jpg",
    "year": "1967"
  },
  {
    "name": "Pressure",
    "artist": "Jim Brown",
    "description": "This is an underrated smasher only available on 12-inch from the 80s. “Pressure,” as in the “Pressure and Slide” riddim, is a good pressing, clear and loud. One of the best DJ cuts from the Studio One stable, so far criminally overlooked by Soul Jazz for their Studio One DJ compilations.",
    "photo": "img/30.jpg",
    "year": "1983"
  },
  {
    "name": "Pressure And Slide",
    "artist": "Hubert Lee",
    "description": "Most people know the Tenors version, but I have always preferred Hubert Lee’s take from 1969, never reissued or repressed. The differences are subtle, most probably due to the usage of more modern studio production techniques, making the track a bit more party/dance-friendly. Thankfully, this is a quality pressing and better than the later represses in the 80s and 90s.",
    "photo": "img/127.jpg",
    "year": "1978"
  },
  {
    "name": "Oh Mr DC",
    "artist": "Sugar Minott",
    "description": "An anthem of our crew and our sound system. The original Jamaican 45 (pictured) is the best pressing. You can also find &lsquo;Oh Mr. DC&rsquo; on Heartbeat’s “Best of Studio One” LP and Soul Jazz’s “Studio One Classics” LP. I have DJed this 45 consistently for over a decade and can confirm that it's indispensable. Very few people know (mainly due to Coxsone not crediting him) that Scientist mixed this song among many others from this period at Studio One.",
    "photo": "img/122.jpg",
    "year": "1978"
  },
  {
    "name": "Home, Home, Home",
    "artist": "Ken Boothe",
    "description": "A favorite family tune in my household.  I recommend this original UK Coxsone pressing - it sounds good, with limited noise. I also have this on a 12-inch, which has an extended mix but is pressed OK at best. I rarely favor the UK pressings of this time as they are dubbed/mastered from Jamaican vinyl, resulting in more hiss and a softer, less dynamic sound. I have gone through every 45 pressing of this song, including the blank, the original Studio one label 45s, and the US pressing - they all have surface noise and don’t sound as good as the UK pressing in my opinion. Also repressed by Soul Jazz on “Studio One Rocksteady” cleanly.",
    "photo": "img/87.jpg",
    "year": "1967"
  },
  {
    "name": "Drum Song",
    "artist": "Soul Vendors",
    "description": "No perfect pressings of this on 45, but I’d take the original Jamaican pressing (or the blank) over all others. For many years I took the 70s Coxsone repress to gigs, which was passable. I was later excited to find a copy of the UK pressing, but was ultimately disappointed - it plays loud but has constant background noise. Both the UK Coxsone and Studio One pressings play with background noise, even the very expensive 60s UK pressing with “Captain Cojoe” on the flipside (which trades for mad money). Ultimately the Jamaican pressing plays with less noise and is just as loud.  \"Drum Song\" is reissued by Soul Jazz on \"Jackie Mittoo - The Keyboard King,\" which stands as the definitive compilation of one of the most definitive Jamaican session players ever, as well as “Mojo Rocksteady Beat” the retrospective on the Soul Vendors and Sound Dimension.",
    "photo": "img/166.jpg",
    "year": "1967"
  },
  {
    "name": "Let’s Join Together",
    "artist": "Melodians",
    "description": "This UK pressing is decent, but unfortunately it's the best available if you don't have a lot of money or time on your hands to try to track down either of the Jamaican pressings. Erroneously credited in the UK to the Gaylads, this is a different version than the widespread Treasure Isle recording of the same track. The Jamaican pressing is titled “Throw Down Your Weapon” and is from the same stamper as the UK version, so both have the same amount of surface noise. If you can get your hands on it, the Jamaican pressing is preferable on a loud sound system as it has less distortion on the chorus and the highs. I've never owned it, due to its high price and relative obscurity, but have heard it played out and it definitely trumps the UK pressing. There is also an extremely rare test pressing, thought to be less than 10-20 copies produced as a test run that has one of the rarest Studio One songs, “Heartaches and Teardrops,” with Jackie Mittoo and the Soul Brothers backing the Melodians. The pressing is said to be terrible, so more of a collector's copy than one is.",
    "photo": "img/105.jpg",
    "year": "1967"
  },
  {
    "name": "Express Yourself",
    "artist": "Leroy Sibbles",
    "description": "Surprisingly, I'd recommend this Soul Jazz 45 repressing over all other versions available - it's heavy duty and sounds cleaner than any of the previous pressings. I was first exposed to this fantastic Studio One cover of Charles Wright’s funk anthem via Soul Jazz’s “Studio One Soul” compilation. I then found the original 45 on a blank in a warehouse in Nassau County on Long Island and DJed that copy for years. It was decent, but has some substantial background noise. I’ve also DJed the later pressings (white/off-white Coxsone labels) using the same stamper and have similar levels of background noise. I finally upgraded to this Soul Jazz 45 repress and don't plan on going back.",
    "photo": "img/70.jpg",
    "year": "1970"
  },
  {
    "name": "Open The Gate",
    "artist": "Ethiopian",
    "description": "\"Open The Gate\" is a very obscure, nearly impossible-to-find 45 - it took me years just to confirm it existed! This is a good 45 pressing from the 1970s (light static present) and a desert island Studio One selection. I played this tune for years off Heartbeat’s “Full Up: Best Of Studio One Volume 2” LP before acquiring this 45 from Japan.",
    "photo": "img/124.jpg",
    "year": "1979"
  },
  {
    "name": "Give Me Back Mi Language And Me Culture",
    "artist": "Count Ossie Im",
    "description": "Easily one of the most profound records I own. You can only find it on two 45s - the extremely rare Sight N Sound Jamaican pressing and hidden on the back side of the UK Banana pressing of “So Long Rastafari Calling.” I prefer the UK pressing - the Coxsone productions on Banana are generally of pretty good vinyl quality and play loud. I owned the Jamaican pressing at one point but sold it as it has static on top of the music throughout. A massive record and a favorite of mine. I crushed a party in the Hawaiian homesteads of Waimanalo with this cut and never looked back. Music with a message!",
    "photo": "img/79.jpg",
    "year": "1970"
  },
  {
    "name": "No Man Is An Island",
    "artist": "Dennis Brown",
    "description": "I’ve gone through a variety of pressings of what may be Dennis Brown’s most timeless tune. Ironically, given how masterful his songwriting was, it’s a cover. The original Jamaican blank is the best in my opinion - louder and less distorted when you turn it up. The NYC pressing is good, but not great. The blank is also a better pressing than the later 70s pressings using the same stamper, for reasons unknown it sounds warmer and fuller head-to-head. The 12” has surface noise/hiss and I don’t suggest it, especially considering how much money it will cost you. The only 45 I haven't been able to listen to in person is the UK Banana pressing - it's alluded me for many years. &lsquo;No Man Is An Island&rsquo; is also included on Soul Jazz’s compilation &lsquo;Studio One Classics&rsquo; at an economy price. ",
    "photo": "img/118.jpg",
    "year": "1970"
  },
  {
    "name": "Soul And Inspiration",
    "artist": "Freddie McGregor",
    "description": "An “off the beaten path” Freddie track covering the Righteous Brothers’ hit song. All three pressing variations use the same stampers and are pretty similar. The 12” is recommended as it plays loud over a good system but is average at best with persistent surface noise.",
    "photo": "img/36.jpg",
    "year": "1977"
  },
  {
    "name": "My Sweet Lord",
    "artist": "John Holt",
    "description": "My father was a Hare Krishna and loved John Holt, but he didn’t love this version because he moved a lot of George Harrison’s religious overtones out of the song (which is why I like it!). “My Sweet Lord” was only on a UK LP on the Melodic label for years, then thankfully it was added onto Heartbeat’s Holt compilation, “I Can’t Get You Off My Mind.” The Heartbeat compilation is one of my go-to records when we have friends over and I want to play a full length. Heartbeat’s reissue material has marinated over the years.",
    "photo": "img/17.jpg",
    "year": "1972"
  },
  {
    "name": "Back Out",
    "artist": "Wailing Souls",
    "description": "Later redone for Channel One, this original Supreme pressing is the choice cut of this tune. The 70s pressings sound quieter with more hiss evident, and the Banana UK pressing has less background hiss but doesn't sound great. Every pressing of this song (including the one on the LP) has background noise so I have to assume it was an issue with the master tapes. The track is also included in the essential Heartbeat compilation, “When Rhythm Was King.” Though the cover of this compilation says “collectors beware,” I beg to differ! The liner notes, overall sound quality, and pressing make this a good pick up even for the most in-depth Studio One head. Plus it’s a certified crate saver.",
    "photo": "img/51.jpg",
    "year": "1970"
  },
  {
    "name": "Jamaica",
    "artist": "Alton Ellis",
    "description": "The only excuse for this never being a single is how deep Alton’s catalog is! This track is reason enough to look for a good pressing of this classic “Best of” compilation, and I think the 80s NYC pressing is the best you could do. It should also be noted that the silkscreen cover doesn’t necessarily denote an early pressing of this record. Coxsone must have had some leftover silkscreened covers from the earlier pressings, so when he repressed the record in the 80s he used the old cover. If you're lucky you'll end up with the best of both worlds - the silkscreen cover with the red and yellow label 80s NYC pressing.",
    "photo": "img/145.jpg",
    "year": "1969"
  },
  {
    "name": "I’m Still Waiting",
    "artist": "The Wailers",
    "description": "I love that this is barely a reggae record! Some of my favorite Wailers material is when they're on that soul tip. This is a rare original on the seldom seen black Coxsone label. It uses the same matrix as the 70s pressing but has a more vibrant bass and warmth to it. The earlier red and white label press is not as good - it doesn't sound awful but are a tiny bit distorted when pushed loud. Included on Soul Jazz’s release “Studio One Lovers,” one of my favorite compilations albums that label has done. Also repressed nicely in Heartbeat’s Wailers 45 box set “The Studio One Singles” with a different b-side.",
    "photo": "img/99.jpg",
    "year": "1965"
  },
  {
    "name": "Sinner Man",
    "artist": "The Wailers",
    "description": "A serious versioning of this classic tune! I have gone through so many pressings of this 45, and honestly they all sound like garbage. All have the surface hiss that makes it impossible to DJ or in some cases, even listen to them. Years later I have settled for playing the record off Heartbeat’s compilation, “Climb The Ladder.” The pressing is mostly noise-free but doesn't play as loud since it’s on an LP.",
    "photo": "img/147.jpg",
    "year": "1966"
  },
  {
    "name": "Dancing Mood",
    "artist": "Delroy Wilson",
    "description": "A few years ago, I played an old friend's wedding in Los Angeles and she specifically requested this song - it took a few months trying to find a quality pressing! I went through a variety of 1960s Jamaican pressings that use the original ska mix, easily identified by the inclusion of “More and More Amour” on the b-side. Unfortunately, most are hard to find in good condition. The Island UK pressing is the most accessible, but I was never crazy about the way it sounded. The later 1960s and 1970s pressings include a slightly different and more rocksteady take of “Dancing Mood,” with the dub on the b-side. This is the first pressing of that take from 1968 - none are great so might as well go OG. The usually reliable 80s red/yellow label US pressing sucks in this case as it’s from the same tired stampers, not a recut stamper. Also compiled by Soul Jazz on the indispensable “Studio One Story” LP.",
    "photo": "img/61.jpg",
    "year": "1968"
  },
  {
    "name": "How Strong",
    "artist": "Ken Parker",
    "description": "The prototypical Studio One slow burner covering O.V. Wright’s “That’s How Strong My Love Is,” a song Otis Redding went on to make famous. I’ve never been much of a Ken Parker fan, but this is a fantastic rendition. This is the extremely rare Jamaican blank - it has some noise throughout, but has a much warmer and fuller sound than any other pressings available. The UK pressing, which is typically a good bet, is pretty poor quality compared to a lot of the Coxsone UK pressings of other Studio One material - it sounds like a bad tape rip with lots of distortion present. There's also a good quality version pressed on the Soul Jazz “Studio One Soul” compilation.",
    "photo": "img/92.jpg",
    "year": "1967"
  },
  {
    "name": "Willow Tree",
    "artist": "Alton Ellis",
    "description": "This is the only pressing of this tune on 45. Very obscure, wasn’t even listed on Discogs for years. As Alton bounced back and forth from Duke Reid’s Treasure Isle to Studio One, he cut numerous songs for both labels. I much prefer this harder-edged take for Coxsone to the Treasure Isle cut. Also available on the LP Mr. Dodd compiled, “Best Of Alton Ellis.” The red and yellow label US pressing is the choice pressing for that LP.",
    "photo": "img/176.jpg",
    "year": "1977"
  },
  {
    "name": "Power Version",
    "artist": "Dennis Alcapone",
    "description": "This original Coxsone label pressing of \"Power Version\" is similar to most original pressings - it plays loud but with some surface noise and intermittent crackling. This is one of my favorite DJ cuts from Studio One of all time, Dennis Alcapone’s best song. Nicely pressed on “Studio One DJ’s” via Soul Jazz.",
    "photo": "img/129.jpg",
    "year": "1972"
  },
  {
    "name": "Africa",
    "artist": "Gaylads",
    "description": "Great reissue of \"Africa\" by Soul Jazz, a very high-quality pressing. This is the second time the label has repressed this murderous roots heat rock, the first being on the very well received “Studio One Roots” LP. Much needed, as this song was hard to source on 45. The original UK pressing is at least a 500 dollar record, which is kind of ridiculous as it’s not very high quality and has noticeable surface noise throughout. I spent many years scouring record stores in the five boroughs and online for a copy of this song on the desirable US pressing (red and yellow label), and when I finally found one I was a bit disappointed to learn that it uses the original stampers. Any pressing off those stampers, including the original, has bits of noise and pressing oddities. Though rare, in this case I recommend the Soul Jazz reissue.",
    "photo": "img/45.jpg",
    "year": "1967"
  },
  {
    "name": "I Don’t Want To See You Cry",
    "artist": "Ken Boothe",
    "description": "This UK pressing on Island trades for a couple of hundred bucks at times, and I usually don’t like Island 60s pressings, but it plays with less hiss than any of the Jamaican pressings. The other highly coveted pressing is on the Bra label (which is unconfirmed, but I presume to be a label of Byron Lee’s), and that one also plays with some hiss. Even the 60s Jamaican pressings (green and red label versions) and the pre-release blank with the Wailers cut on the flipside, have surface hiss. The 70s Jamaican pressing is playable out and oddly has less hiss in the background and static on top than the 60s pressings.",
    "photo": "img/63.jpg",
    "year": "1966"
  },
  {
    "name": "I’m Gonna Take Over Now",
    "artist": "Ethiopians",
    "description": "Over the years I’ve DJed this copy, the original Jamaican pressings, and a later 80s or 90s Rosette pressing - no pressing is excellent, but it's something you have to live with if you want to play this essential cut. This tune is just so clash-ready and battle-tested over the years that I'd play it no matter the quality. All versions are pressed from the same stamper so the older and closer to the original date of the stamper creation the better. Later re-released by Soul Jazz on “Studio One Ska,” although the surface noise is present still.",
    "photo": "img/93.jpg",
    "year": "1966"
  },
  {
    "name": "Groove Me",
    "artist": "Leroy Sibbles",
    "description": "If it weren't for Soul Jazz, not many people would know this version of &lsquo;Groove Me.&rsquo; They included it in the crucial “Studio One Soul” compilation and it is a real dance party starter. This single is from the 70s and oddly was not pressed again. Steady but minimal/bearable background noise throughout and usually sells for over a 100 bucks.",
    "photo": "img/81.jpg",
    "year": "1970"
  },
  {
    "name": "Easy Snapping",
    "artist": "Theo Beckford",
    "description": "Pressed initially on Worldisc before Coxsone started Studio One, “Easy Snapping” is an early Coxsone burner, made for warming up the scene. This is a later 70s pressing that I got from an old spot in Hartford - the shop always carried heat and was off a lot of people’s radar. The original pressing has more background hiss as most Jamaican 45s from pre-1965 don’t sound very good and were cheaply done by today's standards. Reissued by Soul Jazz on the must buy “Studio One Story” LP.",
    "photo": "img/69.jpg",
    "year": "1959"
  },
  {
    "name": "Jail House",
    "artist": "The Wailers",
    "description": "Ultimately the Supreme pressing and the various Studio One pressings from this period - yellow/black (shown here), red/white, and white/black all play similar as they are from the stampers and have the same matrix number. I have the Studio One original pressing from the early 70s or late 60s which is coveted by many even though it plays with surface noise. I recently bought the Bamboo UK pressing, thinking it would be an upgrade. It was not! The Jamaican pressing is louder and sounds warmer. The Supreme pressing also plays very well and is on thick vinyl. The song was initially released on a Muzik City blank and various pressings in 1966 as “Good Good Rudie “ which also play similarly. Reissued by Soul Jazz on “Studio One Rude Boy” and Heartbeat on “One Love At Studio One (1964-1966),” perhaps the definitive compilation of the early Wailers material for Coxone.",
    "photo": "img/101.jpg",
    "year": "1966"
  },
  {
    "name": "Rasta Shook Them Up",
    "artist": "The Wailers",
    "description": "The Dub Store reissue of \"Rasta Shook Them Up\" was a revelation as all the previous pressings left something to be desired. At one point I would DJ out the 60s Coxsone pressing, but it has a hiss, as do most pressings. The UK pressing on Dr. Bird was terrible. I then started to play this song off the Heartbeat compilation of early Peter Tosh tunes, “The Toughest,” but the hiss was only slightly reduced and sounded like it came from the vinyl. It's hard to argue with an affordable, high-quality Japanese reissue of this caliber. The tune was recorded when Bob Marley was in America working at a car plant to raise money to form an independent label.",
    "photo": "img/132.jpg",
    "year": "1966"
  },
  {
    "name": "Come Forward",
    "artist": "The Silvertones",
    "description": "Stuart and company enlightened me with this tune on their “Studio One Disco Mix” compilation (Soul Jazz). Versioning Ken Boothe’s “Come Running Back,” both late 70s pressings of this sound good and are from the same stamper.",
    "photo": "img/58.jpg",
    "year": "1981"
  },
  {
    "name": "Message From A Black Man",
    "artist": "The Heptones",
    "description": "This is the pre-release blank of the original pressing from 1969 and it's the best copy I’ve owned. I don’t always find the blanks to be the best pressings (as some claim), but for a lot of pressings, they are superior. The blanks came in runs of 50-100 for sound system play and promotional use. Studios like Federal also mastered and pressed the blanks with loud sound system play in mind. For years I played the original pressing with the pink and white label, and it worked out at parties but is a bit rough around the edges. The Bamboo UK pressing has more surface hiss, but it doesn’t overpower the music. Also compiled on the classic Soul Jazz release, “Studio One Soul.”",
    "photo": "img/112.jpg",
    "year": "1969"
  },
  {
    "name": "Treat Me Good",
    "artist": "Peter Tosh And The Wailers",
    "description": "The original Jamaican pressing of \"Treat Me Good\" was mistakenly credited to “Bop and The Beltones,” but this original UK Coxsone blue label press credits the song to his former alias, “Peter Touch.” The Jamaican represses use the UK stampers so are similar to the original UK copy but don’t sound as good head-to-head. The recording of this song isn’t great, so you’re not going to find a particularly hi-fi copy anywhere. Jamaican pressings on red, green, and even black text labels from 1967 will all have pressing noise but are worth sourcing based on how good this song is (be warned they don’t show up often). Also re-released in the 1990s On the Peter Tosh compilation LP “The Toughest” via Heartbeat.",
    "photo": "img/172.jpg",
    "year": "1967"
  },
  {
    "name": "I Hold The Handle",
    "artist": "The Heptones",
    "description": "I once read that Sugar Minott said sound systems in Jamaica used to play this entire record from front to back and people would ask them to pull up the whole LP! This is one of the pillars of Studio One and in my opinion one of the most excellent Jamaican records of all time. The Coxsone UK pressing, with the alternate cover, is very expensive. People will pay $500 for it, which I never really understood as the record doesn’t sound great and has background noise. I own an original Jamaican copy that I don’t often play, even at home, as the NYC red and yellow 80s label pressing sounds so much better.",
    "photo": "img/21.jpg",
    "year": "1968"
  },
  {
    "name": "Imperial I",
    "artist": "Peince Jazzbo",
    "description": "Famed cut over Burning Spear’s “Door Peeper” - this took me a long, long time to find on 45 and it plays clean. I played it for years off of a copy of the “Choice of Version” LP, which leaves a lot to be desired as far as quality. For some reason that Jazzbo album was recorded in the 70s but first released in the 90s, way after the fact. There is also a yellow label pressing on Bongo Man and a blank that are pretty much identical.",
    "photo": "img/98.jpg",
    "year": "1972"
  },
  {
    "name": "Rastaman Camp",
    "artist": "Freddie McGregor",
    "description": "At first, I had a 1970s OG blank with the red Studio One label, but it's a foggy pressing and doesn’t sound great. This 2000s pressing is unexpectedly the best. The highly desired Winro pressing has more distortion and press noise than the latter repress, oddly. Don’t get me wrong, neither is great. But the song is! I have DJed the 2000s pressing for years, but mostly at roots parties in the daytime since the tune is slow. Included on the Soul Jazz “Studio One Supreme” compilation but the version is more of a disco 12-inch style mix and not as heavy as the original mix.",
    "photo": "img/131.jpg",
    "year": "1976"
  },
  {
    "name": "Having A Party",
    "artist": "Dudley Sibley",
    "description": "Sam Cooke’s original cut of this is a serious party tune - so is this cut, which stays close to the original. Of all the most recent represses from the old Jamaican stampers, this is one of the best. In most cases, the less popular the song, the better the stampers sound after all these years. Because fewer records were pressed off it, there’s less wear and tear. Coxsone was not quick to replace his stampers and would milk them to all hell. I compared the original UK Banana pressing to this pre-release Jamaican blank, the first pressing 0 they're somewhat similar but the UK copy has more distortion and doesn't knock as much.",
    "photo": "img/83.jpg",
    "year": "1970"
  },
  {
    "name": "One Love",
    "artist": "The Wailers",
    "description": "I used to play a copy of this tune from Heartbeat’s Wailers 7” singles box. As Ernie B said, it’s “one for the ages.” Unfortunately I scratched the shit out of it one night at a crazy house party, and now it skips. \"One Love\" was recorded poorly, so any pressing isn’t going to be amazing. The 70s pressings have slight overdubs with a different mix, making the song passable over a loud sound system. Though no version is great, I mostly play out this earlier 70s pressing. I have also played out the blue Coxsone pressing, which is also a 70s pressing and is in high demand - it plays loud with infrequent minimal surface noise/background hiss. In response to the remake of this song in the 80s, Coxsone released a horrible overdubbed version that you should pass over if you ever come across it.  The original 1965 pressing (not the greatest period for Jamaican vinyl quality overall) has varying levels of surface noise and is very desired/expensive. This pressing is more of a collectors copy than a DJ copy, which I owned it at one point and didn’t care how it sounded on a loud sound system. Reissued multiple times by Heartbeat besides that singles box, including the excellent double LP in 2006 \"One Love At Studio One (1964-1966).\"",
    "photo": "img/123.jpg",
    "year": "1965"
  },
  {
    "name": "Door Peeper",
    "artist": "Burning Spear",
    "description": "This tune launched one of the most enigmatic voices of our time, the man called Burning Spear. For years I assumed the Bamboo UK pressing was the best way to go if you’re serious about playing this song loud. That wasn’t the case - this original Supreme pressing is louder than the Bamboo and Coxsone pressings (which uses the same stamper), and pressed on thicker vinyl. Although the Bamboo plays cleaner than the Jamaica original pressings, it also sounds flat and slightly distorted. The old Jamaican pressings aren’t bad - they have slight hiss but are much more playable over a loud sound system than other Burning Spear singles of the time. This was mainly due to the fact that Sylvan Morris was still engineering at Studio One during this era, whereas the later material was engineered by Coxsone after Morris left in 1972. Let's just say Coxsone was better at finding talent than he was at mixing records. The blank pre-release copies do not play as loud as the Supreme, but they are all pretty comparable on quick listen. Reissued cleanly on both Soul Jazz and Heartbeat’s Burning Spear compilations, chronicling his early years at Studio One.",
    "photo": "img/67.jpg",
    "year": "1969"
  },
  {
    "name": "Jah Light",
    "artist": "Judah Eskender Tafari",
    "description": "Studio One heads know “Pirate’s Choice” is one of the best compilations of Studio One material ever, released after Coxsone’s hand was forced in response to a Canadian bootleg release. In my opinion, it sounds best on the original US pressing.  \"Pirates Choice\" includes a killer version of \"Jah Light,\"  which oddly has never appeared elsewhere. The 45 pressing has a different rockers sound to the riddim. It was later repressed by UK reissue label Soul Jazz on \" tudio One Roots Volume 3\" .",
    "photo": "img/29.jpg",
    "year": "1978"
  },
  {
    "name": "Rockfort Rock",
    "artist": "Sound Dimension",
    "description": "This second pressing, which has a blank label on the b-side (God I Version), is the best pressing to play out. I’ve compared it to the other 1972 pressing with the Mad Lads track on the b-side, and it sounds superior even though they use the same stamper. The original pressing was titled “Psychedelic Rock” and has a slightly different mix - you can find it on a red and white UK Studio One pressing, but any copy I've heard has surface hiss. There is also a Jamaican issue on Coxsone, and blanks turn up once a decade (also with surface hiss). In summary, I have always preferred the later “Rockfort Rock” mix, and this version is the best quality I've come across. The most affordable way to play this out would be on Heartbeat’s excellent compilation “Downbeat The Ruler.” Soul Jazz also compiled “Rockfort Rock” on “Mojo Rocksteady Beat.”",
    "photo": "img/138.jpg",
    "year": "1972"
  },
  {
    "name": "Simmer Down",
    "artist": "The Wailers",
    "description": "“Simmer Down” was a smash hit reportedly selling over 80,000 copies. This 70s Coxsone pressing is the preferred DJ copy and very quality compared to most pressings of this era by Mr. Dodd; only very slight surface noise is present. The Coxsone pressing from the 60s (on various colored vinyl) is the most expensive and desired - it plays loud with some crackle and surface noise; more of a collector’s copy than a DJ copy. The original UK pressing on Ska beat is comparable, but the Jamaican 60s pressing is warmer sounding to me and has less distortion when played loud. It's also included in Heartbeat’s “Studio One Singles” 7-inch box set (reportedly pressed from the master tapes), which is now out-of-print and sells for over $100. I'm kicking myself now for not getting it when it was $34.95, but I was broke then and barely had burrito money. Nicely compiled on the crucial “Studio One Classics” compilation and the “Down Beat Special” 45 box set by Soul Jazz. Heartbeat put the song out on multiple compilations, “Ska Bonanza: The Studio One Ska Years” and “One Love At Studio One (1964-1966)” - both are over-stacked with tracks, making it mandatory to turn up the LP considerably in a DJ set to compensate. Both are crucial retrospectives of 1960s Jamaican music, but not choice to DJ.",
    "photo": "img/143.jpg",
    "year": "1964"
  },
  {
    "name": "Unchained",
    "artist": "Bob Andy",
    "description": "I love this 12” mix. The horns work for me, and this is always a smasher at any rootsman party. This pressing plays loud and heavy but is unofficial - I believe it’s an Italian bootleg; some copies have a bootleg Winro label, and others (like this) just a white label.  You can find a decent 70s pressing of the regular mix (no horns) on the back-side of the Wailers’ “Let Him Go” 45, though some pops and crackles are present. You can also play the song cleanly off Andy’s classic album “Bob Andy’s Songbook.” Go for the red and yellow 80s NYC pressing, it's superior to the original. I used to own the original 1972 Coxsone pressing (red label) and it is warm and loud but has more pressing noise than the NY pressing. Heartbeat later reissued the original mix on “When Rhythm Was King.”",
    "photo": "img/41.jpg",
    "year": "1969"
  },
  {
    "name": "Tenement Yard",
    "artist": "Eddie Constantine",
    "description": "A little-known devastating piece of 80s sufferers from Coxsone. All-time crusher. As far as the 12-inch, this grey and white label is superior to the blue colored label. Honestly, every version (12-inch or 45) sounds like it was recorded in a tin can. My friend recorded a mint condition vinyl copy of the 12-inch and remastered it for me and gave me an acetate which I play out. The 45 pressing of this isn’t great, similar to most Coxsone pressings with the white and black labels from the late 80s/90s. It plays with distortion and some pressing noise, but like the 12-inch pressing, it still trades for big money. Why has Soul Jazz not reissued this? \"Tenement Yard\" would have been a crucial inclusion on their “Studio One Dancehall” compilation. Prime late era Studio One.",
    "photo": "img/181.jpg",
    "year": "1986"
  },
  {
    "name": "Ethiopians Live It Out",
    "artist": "Burning Spear",
    "description": "I have purchased every pressing of this song on 45 over the years, and they're all terrible quality with serious pressing noise (or tape hiss present from the rudimentary effects on the vocals). It’s a top-tier Burning Spear roots song, so you take it anyway. Heartbeat did a pretty good job to remaster and reduce the hiss on their Burning Spear compilation, as did Soul Jazz, but it’s still present.",
    "photo": "img/180.jpg",
    "year": "1971"
  },
  {
    "name": "Can’t Get You Off My Mind",
    "artist": "John Holt",
    "description": "This tune was never a single, but it should have been! What a tune. It is best played off Heartbeat’s John Holt compilation. John Holt is one of the greatest singers of all time, up there with Otis Redding and Sam Cooke, and his songwriting is nothing short of amazing.",
    "photo": "img/16.jpg",
    "year": "1971"
  },
  {
    "name": "African Descendents",
    "artist": "Alton Ellis",
    "description": "One of the hardest Studio One roots tunes ever. Alton is the greatest Jamaican singer of all time, and he wasn’t afraid to throw down some super militant vibes. Case in point is this monster. This is an early-to-mid-80's US repressing of the 1971 original. I DJed the original Jamaican pressing at one time and the blank; they sound alright, but not as loud as this US repressing. Every 45 pressing of this has background noise as they use the same stamper. Repressed by Soul Jazz on “Studio One Funk.” In the late 90s, a German label Moll-Selekta also compiled this song onto an LP “Arise Black Man 1968 - 1978” compiling some hard-as-nails roots tunes by Alton, which was the first record I ever played it off.",
    "photo": "img/47.jpg",
    "year": "1973"
  },
  {
    "name": "Frozen Soul",
    "artist": "Soul Vendors",
    "description": "Another tune I got from my friend, Ernie, at Ernie B. Ernie knows what sounds good on a loud sound system and once again he doesn’t disappoint! This is a sweet first pressing and is the original mix. The blank, the alternate first pressing with yellow labels, and this copy all sound pretty similar. The early 1970s pressing with the black and white Studio One label plays good but with a little more pressing noise. The later 1970s presses contain this cut in a (less desireable, I think) rockers style. The UK pressing on 45 is very expensive and not worth the money. It sounds pretty similar, minor surface noise included, to the JA issue but doesn't sound as full when played loud.  Included on the instrumental compilation by Soul Jazz “Studio One Scorchers Volume 2”.",
    "photo": "img/75.jpg",
    "year": "1969"
  },
  {
    "name": "I Don’t Know Why",
    "artist": "Delroy Wilson",
    "description": "This is an eternal tune so grab whatever copy you can. This blank is the most coveted of all pressings but still has surface noise. My first copy of this was a 70s Coxson pressing I acquired from an old record haunt in Miami. Like nearly all pressings of this 45, that version has pressing hiss throughout. They are all from the same stamper so the earlier the better (but don’t expect any miracles).  Plays clean off “Studio One Lovers” as well (Soul Jazz).",
    "photo": "img/64.jpg",
    "year": "1971"
  },
  {
    "name": "Time Is Tight",
    "artist": "Sound Dimension",
    "description": "A sweet re-working of the Booker T and the M.G.’s hit of the same namesake. This 70s pressing sounds warm but has minor pressing noise - the blank and the earlier yellow label pressing sound similar and use the same stamper. I’ve never cared for the original UK pressing; I’ve had two copies over the years, and they both had substantial surface noise. The UK pressing via Soul Jazz, on the other hand, is comparable to the Jamaican pressing. And while the Soul Jazz pressing sounds clean and loud, it's clearly digitally remastered. Also included on the LP “Studio one Soul,” again compiled by Soul Jazz.",
    "photo": "img/170.jpg",
    "year": "1969"
  },
  {
    "name": "Easy Take It Easy",
    "artist": "Dennis Brown",
    "description": "This is the original 1972 Jamaican pressing of this roots destroyer, devastatingly sampled later by Gregory Isaacs for Joe Gibbs on “Babylon Too Rough.” Watch out for the later 70s and 80s presses with overdubs, the mix isn't nearly as proper as the original. &lsquo;Easy Take It Easy&rsquo; also plays nice off “Studio One Dancehall” (Soul Jazz).",
    "photo": "img/68.jpg",
    "year": "1969"
  },
  {
    "name": "Jah Jah Way",
    "artist": "Jackie Bernard",
    "description": "My mother’s favorite roots song of all time and a staple selection for any time we get to spend together. This is an extremely rare 45, and I consider myself fortunate to own it. The blank pre-release, if you're able to track it down, sounds pretty much the same. It's also on the bootleg “Studio One Classics Roots” compilation, which has a great track listing but doesn’t have the best sound quality (it's still a serious pocket/crate saver). Soul Jazz probably pulled directly from the original record to include this track on “Studio One Roots 2”, and fortunately they cleaned up the hiss and audio quality.",
    "photo": "img/100.jpg",
    "year": "1972"
  },
  {
    "name": "Declaration Of Rights",
    "artist": "The Abyssinians",
    "description": "I have gone through too many terrible 45 pressings of this tune over the years. I prayed for an original copy using a different stamper, hoping for better quality. I found the original and the blank and was thoroughly disappointed. They both play with hiss - tape hiss from vocal track effects perhaps? This second press (pictured) is a god send! The bass on it just knocks! I have also played this off the Soul Jazz “Studio One Story” LP and the Soul Jazz UK 45 pressing - both sound loud and clear. Heartbeat also reissued this roots classic on the expanded double LP release of “Best of Studio One.”",
    "photo": "img/62.jpg",
    "year": "1970"
  },
  {
    "name": "I Don’t Want To Be Right (Version)",
    "artist": "Alton And The Ili Sticks",
    "description": "This is a very rare 45 - years ago I bought a beat copy from Carter Van Pelt. Since then I had been looking to upgrade, mainly because the dub on this is perfect and unavailable anywhere else. I finally found a cleaner copy at one of the better outlets for old Jamaican 45s on the planet: Coco Isle in Tokyo. I also found a copy in Turkey of all places, but it was about the same condition, VG. The vocal cut is on “Studio One Soul” via Soul Jazz Records.",
    "photo": "img/66.jpg",
    "year": "1972"
  },
  {
    "name": "Creation Rebel",
    "artist": "Burning Spear",
    "description": "Some of the Burning Spear 70s Forward pressings are just ghastly. This is a bit better than that, but not by much. The pressing hiss is almost bearable. Probably best listened to and played out on either Heartbeat or Soul Jazz’s Burning Spear retrospectives, although these remastered LPs just minimize the hiss (and don't eliminate it).",
    "photo": "img/60.jpg",
    "year": "1975"
  },
  {
    "name": "Sing Jah Style",
    "artist": "Johnny Osbourne",
    "description": "Unbelievable cut by Mr. Osbourne in the wake of the riddim revival going on at Studio One in the late ‘70s. \"Sing Jah Style\" sounds best off either the original US or Jamaican Pressings (the 80s Jamaican pressing on red Rosette label is also good) or “Studio One Classics” on Soul Jazz. The “Truth and Rights” LP as a whole is Johnny Osbourne’s masterwork and is easily one of the best full-length records Coxsone released.",
    "photo": "img/149.jpg",
    "year": "1979"
  },
  {
    "name": "My Conversation",
    "artist": "Cornell Campbell",
    "description": "I scored this cheap from Human Head records in NYC. This is a choice US 12 “ pressing and a rare opportunity to get a Studio One lick of the foundation riddim, “My Conversation”. A must-have for any self-respecting sound man based on the riddim alone. Included on “Studio One Rub-A-Dub,” a Soul Jazz compilation highlighting Coxsone’s 70s productions.",
    "photo": "img/5.jpg",
    "year": "1979"
  },
  {
    "name": "Full Up",
    "artist": "Sound Dimension",
    "description": "One of the most versioned rhythms of all time. This is a 1972 era pressing from the original stamper. All pressings play loud but have a bit of crackle and noise. I also have a copy of the first pressing of “Full Up” with a Cecile Campbell tune on the flipside that uses this same original stamper - there is slightly more noise on the pressing but otherwise plays pretty similar. The second, later 70s pressing with the version on the b-side doesn’t play as cleanly. Reissued twice by Soul jazz on “Jamaica Soul Shake Volume 1” and “Studio One Classics.” Heartbeat also put the song out on both editions of their “Full Up” best of Studio One compilations.",
    "photo": "img/76.jpg",
    "year": "1969"
  },
  {
    "name": "Never Give Your Heart Away",
    "artist": "Carlton And The Shoes",
    "description": "This is the 7” album mix - it's a pretty decent pressing with some static and it's very rare to find it in good condition. It’s a bit mellower and doesn’t have overdubs like the more commonly heard 12” mix - Soul Jazz reissued it on “Studio One Lovers,” and it's therefore more widely sessioned. The differences are subtle, but I prefer this original mix.",
    "photo": "img/116.jpg",
    "year": "1977"
  },
  {
    "name": "Get In The Groove",
    "artist": "Heptones",
    "description": "This is the original Coxsone 45, but honestly, most pressings of &lsquo;Get In The Groove&rsquo; are good quality. The Rosette 70s/80s red writing, white label press is good to play out, as well as the red and yellow NYC label press. Repressed by Soul Jazz on “Studio One Groups,” some seriously hard to find tunes on that compilation.",
    "photo": "img/77.jpg",
    "year": "1970"
  },
  {
    "name": "Shelly Belly",
    "artist": "Roland Alphonso",
    "description": "This original UK pressing on Banana plays louder and with less surface noise than any of its Jamaican counterparts. The Jamaican release with half blue label is a bit scrappier, but I DJed it for years before I got the Banana pressing from London.  An underrated cut on the “Love Me Girl” riddim.",
    "photo": "img/142.jpg",
    "year": "1971"
  },
  {
    "name": "What Kind Of World",
    "artist": "The Cables",
    "description": "I've gone through a lot of versions of this 45 and finally settled on this original Jamaican blank - it uses the same stamper as the half color/half white 60s pressings, and is the best I’ve heard to date. The UK blue label pressing from 1968 is the most expensive and desired pressing but it never really hit when I tried to play it loud, largely due to the surface noise on top of the music. For many years I DJed the second most desirable pressing, what I believe to be a US pressing based on the label art. The Jamaican pressings with the half color/half white label sound good but have surface noise and crackles. Over the years I’ve realized there is no perfect pressing of this, most play okay at best, but they all have surface noise and crackles. Reissued by Heartbeat in 2006 on their “Full Up: More Hits from Studio One” an expanded release of this compilation.",
    "photo": "img/175.jpg",
    "year": "1968"
  },
  {
    "name": "You Don't Love Me",
    "artist": "Dawn Penn",
    "description": "Later remade to massive international acclaim, this is the original version. Excellent work by Soul Jazz reissuing this - finally, a 45 pressing of this that is semi-clean and obtainable! Coxsone 70s presses are what you’d expect - pressed loud, a tiny bit of distortion, with varying levels of pressing noise and crackles. The original UK pressing (only on a blank) was my most desired copy for a long time, but I eventually realized it also has background hiss. It sounds to me like the Soul Jazz reissue uses the UK blank pressing mentioned here as the source, possibly recorded straight from the record. The hiss is still present on the Soul Jazz reissue, but it’s a marked improvement. The background hiss also shows up on Heartbeat’s reissue compilation “Feel Like Jumping: The Best Of Studio One Women” so perhaps it is present on the master tapes themselves. Regardless this will get a dancefloor going for sure! Also on “Studio One Rockers” which is like a cheat sheet to rocking a house party.",
    "photo": "img/119.jpg",
    "year": "1967"
  },
  {
    "name": "Let Me Get To Know You",
    "artist": "Otis Gayle",
    "description": "Possibly the hardest rare Studio One tune I own and one of my favorite Studio One songs of all time. Too bad the only pressing available is this terrible Money Disc version. Soul Jazz needs to reissue this tune!",
    "photo": "img/104.jpg",
    "year": "1973"
  },
  {
    "name": "Chase Them Crazy",
    "artist": "Lone Ranger",
    "description": "Very obscure Coxsone DJ production. Lone Ranger and Welton Irie, sparring and toasting all over the Mr. Bassie riddim. This tune has never been repressed or compiled and I’m not sure why. It is only available on this OG Jamaican 45 which routinely sells for good money, even though its quality is on par with a 40s blues record. On the bright side, it's rarity has made it a secret weapon of mine over the years...",
    "photo": "img/56.jpg",
    "year": "1977"
  },
  {
    "name": "Ten To One",
    "artist": "The Mad Lads",
    "description": "I have owned at least five different pressings of this 45, from the original 70s Coxsone/Coxson pressings to the later 90s repressings. All of them are loud but have crackles and imperfections. I've DJed this 80s copy for awhile. The earliest pressings under the group title The Hightlites (The Highlights) have surface noise on top of the music. Even the go-to NYC red and yellow label isn’t great. Another way to play this cleanly over a loud sound system is to play it off “Studio One Lovers” or the 45 box set \"Downbeat Special\" (Soul Jazz).",
    "photo": "img/164.jpg",
    "year": "1971"
  },
  {
    "name": "Choice Of Colour",
    "artist": "Heptones",
    "description": "This is a 70s repressing. I prefer this second pressing to the original blank with the half red/pink label. The first pressing is harder to find, plays noisier, and doesn’t sound as good loud. The Heptones recorded many incredible renditions of American soul standards over the years, but this is at the top of the heap - an unreal version that rivals the Motown original. Also reissued by Soul Jazz on “Studio One Soul 2”.",
    "photo": "img/57.jpg",
    "year": "1970"
  },
  {
    "name": "Rearrange",
    "artist": "The Gladiators",
    "description": "This is the original 1976 pressing (there were two pressings of this tune that year). Both pressings aren't great - somewhat noisy and have distortion on the chorus. But it’s a great song, an exceptional take on the Cables “Baby Why.” Probably the best way to play this is off one of the Gladiators compilations on Heartbeat, which unfortunately are both out-of-print and hard to find. Also appears on “Studio One Roots Volume 3” on Soul Jazz.",
    "photo": "img/134.jpg",
    "year": "1976"
  },
  {
    "name": "Stars",
    "artist": "The Eternals",
    "description": "Cornell Campbell is high on the list of the all-time greatest Jamaican vocalists, and this is one of his top performances. It took me almost 12 years to find a copy of this on Supreme, a loud late 60s/early 70s second pressing. Before I found the Supreme pressing, I DJed out the Jamaican pressing (black and white &lsquo;Studio One&rsquo; label), which is not as good with plenty of surface noise and crackles. The UK Coxsone 45, miscredited to the Heptones, doesn’t play as full or clear on a loud sound system as the Jamaican counterpart. Also appears on “Studio One Rocksteady” (Soul Jazz).",
    "photo": "img/157.jpg",
    "year": "1969"
  },
  {
    "name": "Afrikaan Beat",
    "artist": "Lester Sterling",
    "description": "For about a decade the only pressing I was ever able to acquire of “Afrikaan Beat,” the rhythm source for Barrington Levy’s massive 90s hit “Under Me, Sensi” was a red and white 90s pressing. It was surprisingly decent. The 1960s UK pressing was a holy grail of mine for years, and I was ecstatic to find a copy to DJ finally - I have lost quite a few auctions for that record over the years. I later stumbled upon an even better pressing from a guy I buy records from in Europe. The b-side of Larry Marshall’s “Thelma” on the black and white \" Studio One\"  70s label pressing has this song miscredited to Sound Dimension and alternatively titled “African Chant,” and it sounds good loud! It is now my choice copy. Also appears on Soul Jazz’s “Studio One Scorcher” compilation.",
    "photo": "img/46.jpg",
    "year": "1968"
  },
  {
    "name": "Baby Why",
    "artist": "The Cables",
    "description": "This 45 mix is the album version. The first pressing I had of this and DJed was the OG 60s UK version, a mostly clean pressing that I continue to play years later.  In the past decade, I’ve acquired a variety of the original Jamaican pressings of “Baby Why” (including the blank) which do have some crackling on top of the music but sound warmer (per usual) than the UK counterpart. Every 60s pressing has the same noise/crackling so it must be a foundational issue with the original stampers. I despise the 12-inch version of &lsquo;Baby Why,&rsquo; it's a remix with cheesy synths and I'd recommend avoiding that one at all costs. I have also DJed this song off Heartbeat’s &lsquo;Best of Studio One&rsquo; collection where it plays great, same with the  “Studio One Groups” LP on Soul Jazz.",
    "photo": "img/50.jpg",
    "year": "1968"
  },
  {
    "name": "Love Me Forever",
    "artist": "Carlton And The Shoes",
    "description": "There are so many pressings of this track, yet so few are worth owning. This  Supreme pressing is excellent, although the b-side (“Happy Land”) has a pressing defect and is barely playable. I DJed the 70s second pressing on Coxsone for years, which isn’t terrible but isn’t great.  For years I pursued the yellow and red NYC pressing and was ultimately disappointed to find out it had plenty of pressing noise. The 2017 UK reissue by Soul Jazz plays loud and is a cheap - an easy way to get this on 45. It's also included on the reissue compilations “Full Up: Best of Studio One Volume 2” as well as the Soul Jazz compilation “Studio One Classics.” Both have mad heat on them and are worth owning.",
    "photo": "img/108.jpg",
    "year": "1968"
  },
  {
    "name": "He'll Have To Go",
    "artist": "Roy And Enid",
    "description": "Textbook sweet rocksteady, one of my choice Studio One songs of all time. Beyond Ill. I must have DJed this song for ten years before I realized it was a cover of an old country song. This is the UK pressing, which is pretty decent. There is also a scarcely seen Jamaican blank with a different b-side (Enforcer - “Forgive Me”), which sounds good with minimal crackling and surface noise. Appears on the late 1960s compilation “Ride Me Donkey,” the record I played it off of for years.",
    "photo": "img/85.jpg",
    "year": "1968"
  },
  {
    "name": "Change Your Ways",
    "artist": "Sugar Minott",
    "description": "What a tune! Talk about unheralded. This is the best Sugar Minott tune at Studio One besides “Oh Mr. DC, ” and no one ever plays it! Engineered by a young Scientist during his time at Brentford Road early in his career. Once Soul Jazz put out this Sugar Minott retrospective it became my go-to version - it sounds excellent and has the least pressing noise of all the versions. I also played it for years off the “Live Loving” LP (green cover with the red and yellow label, with overdubs). The original Jamaican pressing of the LP (with the black cover) is a good deep-groove pressing overall, but plays in true stereo with some crackles. I have DJed both many times, and I probably prefer the sparser mix on the black cover pressing. The UK pressing from 1978 is terrible - the vocals just don't pop like the Jamaican pressing.",
    "photo": "img/37.jpg",
    "year": "1977"
  },
  {
    "name": "Have You Ever Been In Love ",
    "artist": "John Holt",
    "description": "The 12-inch mix is a pretty rough pressing compared to a lot of the Studio One 12-inches, which are among the highest fidelity records Coxsone Dodd ever made. This is an average pressing at best with surface noise and imperfections, but it includes a great extended mix. If you want the tune on 45, the Jamaican original pressing (black text/white label with right text only) is fine but also has background hiss - same with the original UK pressing. Regardless of the quality, the pairing of “Change Your Style” and this cut on one 45 is vicious! The pre-release blank sounds good, too, but also has some hiss. I bought the 70s era 7-inch because it had the version on it, unfortunately it plays soft with a hiss, so I don’t suggest it.",
    "photo": "img/14.jpg",
    "year": "1974"
  },
  {
    "name": "Don't Wait For Me",
    "artist": "Albert Tomlinson",
    "description": "A top-of-the-heap rocksteady song! This is the original UK pressing on Giant - it sounds good loud and is a clean pressing overall. There is supposedly a Jamaican pre-release-only blank from this period, but I have never confirmed that. Oddly the “garbage dump” era 90s black and white label pressing sounds good - it has a bit more Jamaican-sounding bottom end than the UK pressing, but has more static and pressing noise. The 2013 reissue sounds awful. “Studio One Lovers” (Soul Jazz) is a great way to play this tune out also.",
    "photo": "img/65.jpg",
    "year": "1968"
  },
  {
    "name": "How Could You Leave",
    "artist": "Freddie McGregor",
    "description": "Covering the classic Heptones song in a proper style! A single-only track that flew under the radar for years. I DJed this for about 7 or 8 years, and no one ever knew this version until Soul Jazz included it on their compilation “Studio One Rub-A-Dub (Studio One In The 1970s)”. This 45 pressing from the 1980s is the only pressing, and it plays loud with only minor background noise.",
    "photo": "img/91.jpg",
    "year": "1978"
  },
  {
    "name": "Have Mercy Mr Percy",
    "artist": "Termites",
    "description": "Holy hell this song is fire. One of the top sufferer's songs to ever surface from Brentford Road. This is a pretty good original UK pressing, with some solid bottom end. The Jamaican copy, oddly pressed on a label called Lyn’s (which never released any other record to my knowledge), has more hiss and surface noise on top of the music - pretty typical of anything made at WIRL from this period. Very hard to find at this point and expensive on either pressing. Compiled once on “Six The Hard Way” via Heartbeat.",
    "photo": "img/111.jpg",
    "year": "1967"
  },
  {
    "name": "Skylarking",
    "artist": "Horace Andy",
    "description": "This is the original 45 pressing, and it’s loud.  There are some rough patches, for sure, but it’s a good DJ copy. It includes the “Underground Vegetable” version on the b-side, which is largely a dub with some key vocal samples. The pre-release blank is also a great copy; I played it out for years. Soul Jazz recently reissued “Skylarking” on 45, and it sounds immaculate - this is certainly the easier, cheaper alternative. It includes the Dub Specialist mix on the b-side, which is a bit spacier and ripe for versioning.  Soul Jazz also reissued &lsquo;Skylarking&rsquo; on a very solid 12-inch pressing in 2001 (which is clean and loud) and on their compilation “Studio One Rockers”, an essential crate saver for any house party. All these reissue options are top quality, but I do still prefer the original pressing - it sounds warmer and contains no digital remastering.",
    "photo": "img/156.jpg",
    "year": "1972"
  },
  {
    "name": "Hello Carol",
    "artist": "The Gladiators",
    "description": "Some severe gutbucket sufferers right here. This Supreme Jamaican pressing is at the top of the heap among the many pressings of this song. The UK pressing is also very desirable, but head-to-head doesn’t sound as loud or warm as the Supreme pressing. A friend of mine randomly got me a copy of this in Italy on a mint condition Muzik City blank - it was a great find, but it doesn’t play as good as the Supreme, or even the other 70s Jamaican copy (with the &lsquo;Studio One&rsquo; label). This song sounds a lot better than some of the other Gladiators material for Coxsone, most likely due to Sylvan Morris engineering it rather than Coxsone himself.",
    "photo": "img/86.jpg",
    "year": "1969"
  },
  {
    "name": "Freak Out",
    "artist": "Jackie Mittoo",
    "description": "An ill cut on the “College Rock” riddim by the keyboard king himself. One of the bedrocks of dancehall and foundation riddims. This is the original Coxsone 70s pressing - the blank sounds very similar and is also a good choice to DJ out. It should be noted that all pressings of this have some level of slight surface noise. This song can also be played cleanly off either Soul Jazz’s “Studio One Story” or Heartbeat’s “Downbeat The Ruler” compilations as well.",
    "photo": "img/74.jpg",
    "year": "1970"
  },
  {
    "name": "Empty Belly",
    "artist": "Ethiopian",
    "description": "This red and yellow label US pressing is the best choice for this classic album. There’s been a lot of hard tunes over the years on the “Hot Milk” riddim, but this may be the hardest. Sufferers music of the highest degree by the Ethiopian, Leonard Dillon. Included on the Soul Jazz compilation “Studio One Rub-A-Dub (Studio One In The 1970s)”.",
    "photo": "img/153.jpg",
    "year": "1980"
  },
  {
    "name": "I'm Just A Guy",
    "artist": "Alton Ellis",
    "description": "Coxsone sometimes used his UK stampers in Jamaica, and apparently, in certain cases, something went wrong in the transfer process - this accounted for the early Jamaican pressings playing with significant pressing noise. The original UK pressing of &lsquo;I'm Just A Guy&rsquo; isn't terrible, but it plays a bit low and with some background noise. The 80s NYC pressing (which has overdubs unlike the OG UK issue) isn’t going to win over any audiophiles, but was my best option to play over a loud sound system for years. Finally I found a copy of this 70s pressing and realized it has a different matrix than any of the earlier Jamaican issues (which all sound similarly terrible). Coxsone must have made a new stamper hence the unique matrix. A Coxson pressing which is very rare and not even listed on Discogs at the time of writing is the only other pressing to use this stamper. I have also DJed this song off the “Studio One Classics” LP by Soul Jazz where it sounds fine but still has background hiss (as it was likely transferred from the original stampers).",
    "photo": "img/97.jpg",
    "year": "1967"
  },
  {
    "name": "Rub A Dub Style",
    "artist": "Michigan and Smiley",
    "description": "A classic tune that is always fit for a party! The next cut to Alton Ellis’ “I’m Just A Guy.” Good original pressing, surprisingly the 45 has less surface noise than the original 12-inch pressing. The 12-inch has an extra DJ verse on the end, but I prefer the shortened 45 cut in this case. Reissued over the years by Heartbeat on “Best Of Studio One” and by Soul Jazz later on “Studio One Classics.” The 12” mix is also on “The Legendary Studio One Recordings” by Soul Jazz. Coxsone was never much to credit anyone, but Scientist did some work for him in the 70s - this stands as one of his best engineering/dub efforts at Brentford Road.",
    "photo": "img/141.jpg",
    "year": "1979"
  },
  {
    "name": "Nice Up The Dance",
    "artist": "Michigan and Smiley",
    "description": "A classic tune by the original DJ duo on the eternal “Real Rock” riddim. This is the first pressing, which sounds good. If you want it super clean play it off “Studio One Story” (Soul Jazz), off 45 out of the “Down Beat Special” box set (Soul Jazz again) or from the “Nice Up The Dance - Studio One Discomixes” compilation. Also mixed (though uncredited) by a young Scientist.",
    "photo": "img/117.jpg",
    "year": "1979"
  },
  {
    "name": "Mad Mad",
    "artist": "Alton Ellis",
    "description": "A 70s pressing of the original riddim source of the now eternal “Diseases” riddim, recorded in 1968 but not released on 45 until the mid-70s. This copy is loud and fine for DJing but has some press noise - not unusual for Coxsone’s 70s pressings. Nicely pressed on Heartbeat’s “When Rhythm Was King” double LP compilation, which is a prime time crate saver.",
    "photo": "img/109.jpg",
    "year": "1968"
  },
  {
    "name": "Party Time",
    "artist": "Heptones",
    "description": "This late 60s pressing plays with slight pressing noise but has a rich loudness to it that is hard to argue with; head-to-head it was very similar to the first pressing blank.  This pressing and the blank both use the original WIRL stamper. The red and yellow label NYC pressing also sounds good with only the slightest background noise. It worked for me for years. The original UK pressing is hard to find but has clear audio and plays loud. Quality versions of this Heptones classic also appear on “Studio One Rocksteady” (Soul Jazz) and “The Best Of Studio One” (Heartbeat) compilations.",
    "photo": "img/125.jpg",
    "year": "1968"
  },
  {
    "name": "Pretty Looks",
    "artist": "Heptones",
    "description": "\"Pretty Looks\" is in the top ten of Jamaican songs for me. The riddim and the song are both eternal. A pillar of not only Studio One but reggae in general. This is the 80s NYC pressing with the Rosette label.  I’ve never been able to acquire the rarely seen blank from 1972 (hopefully one day soon), or the 70s pressing on Coxson to compare.  Soul Jazz repressed this on “Studio One Classics.”",
    "photo": "img/128.jpg",
    "year": "1968"
  },
  {
    "name": "Try A Little Tenderness",
    "artist": "Joe White",
    "description": "Joe White could rock a mean Otis Redding or Sam Cooke cover. If you're a reasonable person, the Flame reissue (pictured) of this timeless Otis tune is the only choice. It was limited to 300 copies but isn’t expensive and sounds good (probably because it's unofficial). The original Jamaican pressing is obscenely rare, appearing on the black Coxsone label or a Muzik City blank that pairs Joe White’s best two songs - &lsquo;Try A Little Tenderness&rsquo; and “My Guiding Star” on the same 45. The pressing is loud and clear with minor background noise. The UK Bluecat pressing is not bad, but it’s not great either. At 150-200 dollars, it's just not worth buying (I learned the hard way). I have also DJed this song off the top-shelf compilation, “Sugar & Spice,” by Japanese label Rock A Shacka. Rock A Shacka is part of a Japanese record store, Drum and Bass, where I’ve gotten some serious Studio One originals over the years.",
    "photo": "img/174.jpg",
    "year": "1968"
  },
  {
    "name": "Love Bump",
    "artist": "Lone Ranger",
    "description": "Lone Ranger’s biggest hit for Studio One has stood the test of time; it’s still getting played consistently decades later. A cornerstone of any retrospective of Studio One, Lone Ranger was one of the best DJs of the early 80s in Jamaica, and his work for Coxsone proves it.  This is an excellent red and yellow label pressing 45, and the 12-inch pressing with the Rosette label is also good - both are more than suitable for sound system play! The original Jamaican pressing, although possessing the same matrix as the US press, plays with more surface noise on top of the music. Properly reissued by Heartbeat years later on both editions of the “Full Up: Best of Studio One Volume 2” compilations (released in 1983, then again in 2006 as an expanded effort), as well as a mandatory inclusion on “Studio One Story” by Soul Jazz.",
    "photo": "img/106.jpg",
    "year": "1981"
  },
  {
    "name": "Feeling Nice",
    "artist": "Rolando-Coral And Sound Dimension",
    "description": "A classic cut with Roland Alphonso going to town over the riddim track to Carlton And The Shoe’s “This Feeling.” Roland has done a lot of incredible work for Coxsone, and this is one of my favorites. At one point I got obsessed with Roland’s playing and couldn’t get enough of him. I went through every single he ever released and couldn’t believe I missed this one for so many years. This original Jamaican 45 is not an amazing pressing, but unfortunately the stampers seem to be the issue. The 2014 repress uses the same stampers and is plagued by the same sound issues. I DJ it out anyway, as this is a severely underplayed Roland cut.",
    "photo": "img/71.jpg",
    "year": "1975"
  },
  {
    "name": "Puppy Love",
    "artist": "Soul Two",
    "description": "In my opinion, the “Ride Me Donkey” LP is the best Studio One full length, and because it's stacked with rocksteady murderers, it’s easy for one to get lost in the fray. I only started fully appreciating how good this song was about five years ago. The best way to play this is off either of the 80s US pressings, one of which is pictured here. There is a very rare 12-inch of “Puppy Love,” which has a more modern mix and sounds wack. Avoid it. Repressed on Soul Jazz’s “Studio One Rocksteady 2” thankfully!",
    "photo": "img/22.jpg",
    "year": "1968"
  },
  {
    "name": "Ride Me Donkey",
    "artist": "Dobby Dobson",
    "description": "Coxsone overdubbed and remixed many classic tracks over the years, and it can be dizzying to sort through for the best version or take. Sometimes the remixing is minor and inconsequential, and all versions are dope - case in point is this tune, every version of “Ride Me Donkey” is a good version. This 45 was released around 1977, but the original take was from the mid- to late-1960s when rocksteady was at its peak. This is the only 45 pressing of this song I’ve ever owned and it's solid. I once saw a 45 pressing of this tune from the late 60s on Coxsone with the Tonettes “I’ll Give It To You” on the flip side in a Japanese shop, Oldies but Goodies, but it played with an incredible amount of pressing noise. I have never found another copy to confirm if all copies have this issue. The original mix also appears on a Coxsone label 45 that has long alluded me, with Slim Smith “Don’t Go Away” on the flipside, which plays loud but also has some surface noise.",
    "photo": "img/136.jpg",
    "year": "1977"
  },
  {
    "name": "Please Be True",
    "artist": "Alexander Henry",
    "description": "Whatever pressing you can find, no Studio One collection is complete without this foundation cut, versioned many times over the years. In my heavy rotation for over a decade. This OG Jamaican blank plays very loud and warm with some static at times but is the best this tune gets on 45. The UK pressing with the same A/B side has surface noise but is also very playable. When I was younger, the first copy I DJed was the original Jamaican pressing from 1969 with Ken Boothe’s “Pleading” on the other side - it plays with slight surface noise and background hiss but sounds warm. The late 60s/early 70s Jamaican pressing is pretty comparable but not quite as clean or loud. Though it sounds similar, the late 60s/early 70s version has a different matrix number implying the usage of a new stamper. The Coxson pressing is garbage as it uses a separate matrix and stamper. Compiled on “When Rhythm Was King” by Heartbeat and “Studio One Kings” by Soul Jazz, and both are top quality.",
    "photo": "img/126.jpg",
    "year": "1969"
  },
   {
    "name": "Unity",
    "artist": "Johnny Osbourne",
    "description": "Top ranking late-era Studio One, 80s vibes. Bringing Don Drummond and the Skatalites immortal “Heavenless’ riddim into the Rub A Dub era. This track is super slept on, never repressed or compiled, and only available on this original 12”. Every copy I’ve owned has “Sir D. Special” on the b-side but I’ve met people who report they have pressings of this record alternatively with “Bushmaster” on the b-side, an instrumental take of the “M16” riddim. I can’t comment on which 12” is tougher…",
    "photo": "img/42.jpg",
    "year": "1981"
  },
  {
    "name": "Feel Like Jumping",
    "artist": "Marcia Griffiths",
    "description": "When I first started playing out at parties, this was a go-to for me. One of the first songs that showed me the power of Studio One, a tune that gets people up and going on the dancefloor! Original pressings of \"Feel Like Jumping\" (JA and UK) have varying levels of surface noise and pops, with this high-in-demand original UK blue label pressing among the cleanest. The original Jamaican pressing (black text, red label) from the late 60s doesn’t sound very good from my experience - lots of pressing noise. The Soul Jazz reissue 45 is of comparable quality to this UK original but doesn’t play as loud or warm. Also included on the Soul Jazz compilation “Studio One Rockers,” a must-have for anyone serious about playing Studio One at house parties. Heartbeat also put the song out on \"Feel Like Jumping: The Best Of Studio One Woman.\"",
    "photo": "img/72.jpg",
    "year": "1968"
  }
]